[
  {
    "Id": "2.6.1",
    "Name": "",
    "Description": "",
    "Domain": "2. 보호대책 요구사항",
    "Subdomain": "2.6. 접근통제",
    "Section": "2.6.1 네트워크 접근",
    "Checks": [
      "s3_access_point_public_access_block",
      "s3_bucket_public_write_acl",
      "s3_bucket_acl_prohibited",
      "s3_account_level_public_access_blocks",
      "s3_bucket_level_public_access_block",
      "documentdb_cluster_public_snapshot",
      "cloudfront_distributions_geo_restrictions_enabled",
      "opensearch_service_domains_not_publicly_accessible",
      "lightsail_instance_public",
      "lightsail_database_public",
      "neptune_cluster_uses_public_subnet",
      "neptune_cluster_public_snapshot",
      "ecr_repositories_not_publicly_accessible",
      "workspaces_vpc_2private_1public_subnets_nat",
      "elb_internet_facing",
      "sqs_queues_not_publicly_accessible",
      "redshift_cluster_public_access",
      "cloudtrail_logs_s3_bucket_is_not_publicly_accessible",
      "awslambda_function_url_public",
      "awslambda_function_url_cors_policy",
      "awslambda_function_not_publicly_accessible",
      "iam_user_administrator_access_policy",
      "iam_group_administrator_access_policy",
      "iam_user_mfa_enabled_console_access",
      "networkfirewall_in_all_vpc",
      "eks_cluster_network_policy_enabled",
      "eks_cluster_not_publicly_accessible",
      "eks_cluster_private_nodes_enabled",
      "eks_cluster_not_publicly_accessible",
      "vpc_peering_routing_tables_with_least_privilege",
      "vpc_subnet_no_public_ip_by_default",
      "vpc_endpoint_services_allowed_principals_trust_boundaries",
      "vpc_endpoint_connections_trust_boundaries",
      "vpc_subnet_separate_private_public",
      "dms_instance_no_public_access",
      "elbv2_internet_facing",
      "elbv2_listeners_underneath",
      "elasticache_cluster_uses_public_subnet",
      "appstream_fleet_maximum_session_duration",
      "appstream_fleet_default_internet_access_disabled",
      "appstream_fleet_session_idle_disconnect_timeout",
      "appstream_fleet_session_disconnect_timeout",
      "rds_snapshots_public_access",
      "rds_instance_no_public_access",
      "rds_instance_event_subscription_security_groups",
      "rds_instance_iam_authentication_enabled",
      "apigateway_restapi_public",
      "apigateway_restapi_authorizers_enabled",
      "apigateway_restapi_public_with_authorizer",
      "sagemaker_training_jobs_network_isolation_enabled",
      "sagemaker_models_vpc_settings_configured",
      "sagemaker_training_jobs_vpc_settings_configured",
      "sagemaker_models_network_isolation_enabled",
      "sagemaker_notebook_instance_without_direct_internet_access_configured",
      "sagemaker_notebook_instance_vpc_settings_configured",
      "ec2_instance_port_ldap_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_any_port",
      "ec2_instance_port_kerberos_exposed_to_internet",
      "ec2_securitygroup_not_used",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_cassandra_7199_9160_8888",
      "ec2_securitygroup_default_restrict_traffic",
      "ec2_instance_port_cifs_exposed_to_internet",
      "ec2_instance_port_kafka_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_oracle_1521_2483",
      "ec2_instance_port_mysql_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_kafka_9092",
      "ec2_securitygroup_allow_ingress_from_internet_to_port_mongodb_27017_27018",
      "ec2_instance_port_ssh_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_postgres_5432",
      "ec2_elastic_ip_shodan",
      "ec2_instance_port_rdp_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_redis_6379",
      "ec2_securitygroup_allow_wide_open_public_ipv4",
      "ec2_instance_port_cassandra_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_telnet_23",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_sql_server_1433_1434",
      "ec2_instance_port_memcached_exposed_to_internet",
      "ec2_networkacl_allow_ingress_any_port",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_mysql_3306",
      "ec2_ebs_public_snapshot",
      "ec2_networkacl_allow_ingress_tcp_port_3389",
      "ec2_transitgateway_auto_accept_vpc_attachments",
      "ec2_instance_port_postgresql_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_ftp_port_20_21",
      "ec2_securitygroup_with_many_ingress_egress_rules",
      "ec2_ami_public",
      "ec2_instance_port_oracle_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_elasticsearch_kibana_9200_9300_5601",
      "ec2_instance_imdsv2_enabled",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_22",
      "ec2_instance_port_elasticsearch_kibana_exposed_to_internet",
      "ec2_instance_port_redis_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_3389",
      "ec2_instance_port_sqlserver_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_memcached_11211",
      "ec2_instance_port_ftp_exposed_to_internet",
      "ec2_instance_public_ip",
      "ec2_networkacl_allow_ingress_tcp_port_22",
      "ec2_instance_port_mongodb_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_all_ports",
      "ec2_securitygroup_allow_ingress_from_internet_to_high_risk_tcp_ports",
      "ec2_instance_port_telnet_exposed_to_internet"
    ],
    "AuditChecklist": [
      "조직의 네트워크에 접근할 수 있는 모든 경로를 식별하고 접근통제 정책에 따라 내부 네트워크는 인가된 사용자만이 접근할 수 있도록 통제하고 있는가?.",
      "서비스, 사용자 그룹, 정보자산의 중요도, 법적 요구사항에 따라 네트워크 영역을 물리적 또는 논리적으로 분리하고 각 영역 간 접근통제를 적용하고 있는가?",
      "네트워크 대역별 IP주소 부여 기준을 마련하고 데이터베이스 서버 등 외부 연결이 필요하지 않은 경우 사설 IP로 할당하는 등의 대책을 적용하고 있는가?",
      "물리적으로 떨어진 IDC, 지사, 대리점 등과의 네트워크 연결 시 전송구간 보호대책을 마련하고 있는가?"
    ],
    "RelatedRegulations": [
      "개인정보 보호법 제29조(안전조치의무)",
      "개인정보의 안전성 확보조치 기준 제6조(접근통제)"
    ],
    "AuditEvidence": [
      "네트워크 구성도",
      "IP 관리대장",
      "정보자산 목록",
      "방화벽룰"
    ],
    "NonComplianceCases": [
      "사례 1 : 네트워크 구성도와 인터뷰를 통하여 확인한 결과, 외부 지점에서 사용하는 정보시스템 및 개인정보 처리시스템과 IDC에 위치한 서버 간 연결 시 일반 인터넷 회선을 통하여 데이터 송수신을 처리하고 있어 내부 규정에 명시된 VPN이나 전용망 등을 이용한 통신이 이루어지고 있지 않은 경우",
      "사례 2 : 내부망에 위치한 데이터베이스 서버 등 일부 중요 서버의 IP주소가 내부 규정과 달리 공인 IP로 설정되어 있고, 네트워크 접근 차단이 적용되어 있지 않은 경우",
      "사례 3 : 서버팜이 구성되어 있으나, 네트워크 접근제어 설정 미흡으로 내부망에서 서버팜으로의 접근이 과도하게 허용되어 있는 경우",
      "사례 4 : 외부자(외부 개발자, 방문자 등)에게 제공되는 네트워크를 별도의 통제 없이 내부 업무 네트워크와 분리하지 않은 경우",
      "사례 5 : 내부 규정과는 달리 MAC주소 인증, 필수 보안 소프트웨어 설치 등의 보호대책을 적용하지 않은 상태로 네트워크 케이블 연결만으로 사내 네트워크에 접근 및 이용할 수 있는 경우"
    ],
    "대응방안 - 커스토디안과 연계": [
      "퍼블릭 Access Point를 탐지하여 'blockPublicAccess' 설정이 true가 아닌 경우 수정 또는 태깅/알림",
      "버킷 ACL에 'WRITE' 권한이 Everyone 또는 AllUsers에 부여되어 있는 경우 탐지하여 해당 권한 제거",
      "ACL 자체 사용이 금지된 정책에 따라 ACL 설정이 존재하는 S3 버킷을 탐지하고 알림 또는 태깅",
      "계정 전체에 S3 Public Access Block 설정이 모두 활성화되어 있는지 확인, 미설정 시 운영자 알림",
      "각 S3 버킷에 대해 Public Access Block 설정이 비활성화된 경우 탐지 및 설정 적용 또는 알림",
      "퍼블릭으로 노출된 DocumentDB 클러스터 스냅샷을 탐지하여 비공개로 변경하는 액션 적용",
      "CloudFront 배포에 대해 지리적 제한이 활성화되지 않은 경우 탐지하고 태깅 또는 경고",
      "OpenSearch 도메인에서 VPC 엔드포인트가 아닌 퍼블릭 접근을 허용하는 설정이 있는지 탐지",
      "퍼블릭 IP가 연결된 Lightsail 인스턴스를 탐지하여 태깅하거나 운영자 알림 제공",
      "Lightsail 데이터베이스 인스턴스가 퍼블릭 엔드포인트를 통해 외부에 노출되어 있는지 점검",
      "Neptune 클러스터가 퍼블릭 서브넷에 배치되어 퍼블릭 접근 가능성이 있는지 탐지",
      "Neptune 클러스터의 스냅샷 중 공개로 설정된 항목을 탐지하고 비공개로 변경",
      "ECR 리포지토리 정책에서 '*'' 또는 외부 계정에 접근 허용된 경우 탐지 후 태깅 또는 알림",
      "WorkSpaces의 VPC 서브넷 구성에서 프라이빗 2개, 퍼블릭 1개의 구성이 아닌 경우 탐지",
      "인터넷에 노출된 internet-facing ELB를 탐지하여 태깅 또는 전환 권고",
      "SQS 큐 정책에서 'Principal: *' 또는 퍼블릭 접근이 가능한 정책을 탐지하고 제거",
      "퍼블릭 접근이 허용된 Redshift 클러스터를 탐지하고 태깅 또는 알림",
      "CloudTrail 로그를 저장하는 S3 버킷의 정책에 공개 접근이 허용되어 있는지 탐지하고 수정",
      "Function URL이 'AuthType: NONE'으로 설정되어 누구나 호출 가능한 경우 탐지하고 태깅/경고",
      "Function URL에 CORS 정책이 overly permissive (예: '*') 인 경우 탐지",
      "Lambda 함수가 인터넷에 직접 노출될 수 있는 설정인지 점검 (예: API Gateway 연결 여부 포함)",
      "IAM 사용자에게 AdministratorAccess 권한이 직접 부여된 경우 탐지하고 운영자 알림 또는 태깅",
      "IAM 그룹에 AdministratorAccess 정책이 부여되어 있는 경우 탐지",
      "콘솔 접근 권한이 있는 사용자 중 MFA가 활성화되지 않은 경우 탐지",
      "모든 VPC에 대해 AWS Network Firewall이 설정되어 있는지 점검하고 없는 경우 경고",
      "EKS 클러스터에서 네트워크 정책(CNI 또는 Calico)이 활성화되어 있지 않은 경우 탐지",
      "EKS API 엔드포인트가 퍼블릭으로 노출된 경우 탐지",
      "EKS 노드 그룹이 퍼블릭 서브넷에 있는 경우 탐지하여 프라이빗 배포 권고",
      "EKS 클러스터의 API 엔드포인트가 public으로 설정된 경우를 탐지하여, VPC 내부에서만 접근 가능하도록 설정 여부 점검 및 알림",
      "VPC 피어링 연결 시 라우팅 테이블이 최소 권한 원칙에 맞게 제한되어 있는지 점검 (0.0.0.0/0 등 광범위 접근이 있는 경우 탐지)",
      "기본적으로 퍼블릭 IP가 자동 할당되는 서브넷인지 점검하고, 'MapPublicIpOnLaunch' 설정이 true인 경우 태깅 또는 수정",
      "VPC 엔드포인트 서비스에 대해 신뢰할 수 없는 Principal(외부 계정, 루트 등)이 접근 가능한 상태인지 탐지",
      "VPC 엔드포인트 연결 요청을 허용한 계정이 신뢰 가능한 내부 계정 범위 내에 있는지 점검",
      "퍼블릭과 프라이빗 서브넷이 분리되어 있는지 확인 (IGW vs NAT GW 연결 여부 기준으로 판단)",
      "DMS 인스턴스에 퍼블릭 IP가 할당되어 있는 경우 탐지 및 알림",
      "Application Load Balancer가 인터넷 연결형(internet-facing)으로 구성된 경우 탐지",
      "ALB에 연결된 Listener 및 Target Group 설정을 점검하여 HTTPS 미적용, 포트 개방 여부 등 보안 설정 분석",
      "ElastiCache 클러스터가 퍼블릭 서브넷에 배치되어 외부 접근이 가능한 상태인지 탐지",
      "AppStream 플릿의 최대 세션 시간(MaxSessionDuration)이 과도하게 설정된 경우 탐지 및 알림",
      "AppStream 플릿이 기본적으로 인터넷에 접근할 수 있는 설정인지 점검하여 차단 미설정 시 알림",
      "AppStream에서 사용자가 비활성 상태일 때 자동 세션 종료 설정이 비활성화된 경우 탐지",
      "세션이 끊겼을 때 연결 유지 시간이 과도하게 긴 경우 탐지",
      "RDS 수동 스냅샷이 Public으로 노출된 경우 탐지 및 'restore access' 제거",
      "RDS 인스턴스에 퍼블릭 IP가 설정되어 있는 경우 탐지 및 태깅",
      "RDS 이벤트 구독(알람)이 보안 그룹 변경 등 중요 이벤트를 포함하는지 점검",
      "IAM 인증이 비활성화된 RDS 인스턴스를 탐지하여 운영자에게 알림",
      "API Gateway가 인증 없이 public하게 노출되어 있는지 확인",
      "API Gateway 리소스에 인증 Authorizer가 설정되지 않은 엔드포인트 탐지",
      "Authorizer가 있음에도 퍼블릭 접근 가능한 API가 존재하는지 교차 분석",
      "SageMaker 학습 작업에서 네트워크 격리(Network Isolation)가 비활성화된 경우 탐지",
      "SageMaker 모델이 VPC 설정 없이 외부 노출 가능한 상태인지 점검하고, VPC 설정이 없는 경우 알림",
      "SageMaker 학습 작업에서 VPC 설정이 없는 경우 탐지하여 내부 네트워크 사용 유도",
      "SageMaker 모델 배포 시 Network Isolation 설정이 비활성화된 경우 탐지 및 경고",
      "노트북 인스턴스에 Direct Internet Access 설정이 활성화된 경우 탐지 및 수정 유도",
      "노트북 인스턴스가 VPC 연결 없이 퍼블릭 환경에 위치한 경우 탐지",
      "LDAP 포트(389, 636)가 퍼블릭 IP와 보안 그룹을 통해 외부에 노출된 EC2 인스턴스 탐지",
      "보안 그룹에서 0.0.0.0/0에 대해 모든 포트를 허용하는 overly permissive 규칙 탐지",
      "Kerberos 포트(88, 464)가 외부 접근 가능한 인스턴스를 탐지",
      "어떠한 인스턴스에도 연결되지 않은 미사용 보안 그룹을 탐지하여 정리",
      "Cassandra 포트에 대한 인터넷 인바운드 허용 보안 그룹 탐지",
      "기본 보안 그룹이 인바운드 또는 아웃바운드 트래픽을 너무 넓게 허용하고 있는지 점검",
      "CIFS/SMB 포트(445 등)가 퍼블릭으로 열려 있는 EC2 인스턴스 탐지",
      "Kafka 포트(9092 등)가 퍼블릭 접근 가능한 인스턴스에 열려 있는지 탐지",
      "Oracle DB 포트에 대해 인터넷 접근을 허용하는 보안 그룹 탐지",
      "MySQL 포트(3306)가 퍼블릭 IP + 오픈 보안 그룹 조합으로 외부 노출된 인스턴스 탐지",
      "Kafka 포트에 대해 인터넷 접근을 허용하는 보안 그룹 탐지",
      "MongoDB 포트(27017, 27018)에 대해 공개 접근 허용 여부 탐지",
      "SSH(22번 포트)가 퍼블릭으로 열려 있는 EC2 인스턴스 탐지",
      "PostgreSQL 포트(5432)에 대해 0.0.0.0/0 또는 ::/0로부터 인바운드가 허용된 보안 그룹을 탐지하여 태깅 또는 알림",
      "Shodan 등 공개 검색 엔진에 노출된 Elastic IP가 할당된 인스턴스를 탐지하여 알림",
      "RDP 포트(3389)가 퍼블릭 IP와 오픈된 보안 그룹을 통해 인터넷에 노출된 인스턴스를 탐지",
      "Redis 포트(6379)에 대해 0.0.0.0/0 접근이 허용된 보안 그룹을 탐지하고 수정 또는 태깅",
      "0.0.0.0/0 또는 ::/0로 모든 포트/프로토콜이 허용된 보안 그룹을 탐지",
      "Cassandra 관련 포트(7199, 9160, 8888 등)가 퍼블릭으로 노출된 EC2 인스턴스를 탐지",
      "Telnet 포트(23)에 대해 외부 인바운드가 허용된 보안 그룹 탐지",
      "SQL Server 포트(1433, 1434)에 대해 인터넷에서 접근 허용된 보안 그룹을 탐지",
      "Memcached 포트(11211)가 퍼블릭으로 노출된 EC2 인스턴스를 탐지",
      "Network ACL에서 0.0.0.0/0에 대해 전체 포트를 허용하는 overly open 규칙 탐지",
      "MySQL 포트(3306)에 대해 인터넷에서 인바운드 허용된 보안 그룹 탐지",
      "퍼블릭으로 공유된 EBS 스냅샷을 탐지하고 `modify-snapshot-attribute`로 공개 해제",
      "RDP 포트(3389)가 허용된 네트워크 ACL 엔트리를 탐지",
      "VPC Attachment 요청을 자동 수락하도록 설정된 Transit Gateway 탐지 및 알림",
      "PostgreSQL 포트가 열려 있는 EC2 인스턴스가 퍼블릭 IP 및 오픈 SG를 통해 인터넷에 노출되었는지 탐지",
      "FTP 포트(20, 21)에 대해 외부 접근이 가능한 보안 그룹 탐지",
      "인바운드/아웃바운드 규칙 수가 과도한 보안 그룹을 탐지 (예: >50개 등 기준 설정)",
      "퍼블릭으로 공개된 AMI를 탐지하여 `modify-image-attribute`로 비공개 전환 또는 알림",
      "Oracle 포트(1521 등)가 외부에 노출된 인스턴스를 탐지",
      "Elasticsearch/Kibana 포트에 대해 인터넷 인바운드 허용된 SG 탐지",
      "EC2 인스턴스에 대해 Instance Metadata Service v2(IMDSv2)가 설정되어 있는지 점검",
      "SSH 포트(22)에 대해 외부 접근이 허용된 보안 그룹을 탐지",
      "EC2 인스턴스가 Elasticsearch 또는 Kibana 포트를 통해 퍼블릭 접근 가능한지 탐지",
      "Redis 포트가 퍼블릭으로 노출된 인스턴스를 탐지",
      "RDP 포트(3389)에 대해 인터넷 접근이 허용된 보안 그룹 탐지",
      "SQL Server 포트가 퍼블릭 IP와 함께 오픈된 인스턴스 탐지",
      "Memcached 포트(11211)에 대해 외부 접근 허용한 보안 그룹 탐지",
      "FTP 포트(20, 21)가 퍼블릭으로 노출된 EC2 인스턴스 탐지",
      "퍼블릭 IP가 부여된 EC2 인스턴스를 탐지하여 태깅 또는 제어",
      "SSH 포트(22)에 대해 0.0.0.0/0 접근이 허용된 NACL 엔트리 탐지",
      "MongoDB 포트(27017 등)가 퍼블릭으로 노출된 인스턴스를 탐지",
      "모든 포트를 0.0.0.0/0에 대해 허용한 보안 그룹 탐지",
      "고위험 포트 목록(Telnet, Redis, RDP 등)을 인터넷에 허용한 보안 그룹 탐지",
      "Telnet 포트(23)가 퍼블릭으로 노출된 인스턴스를 탐지"
    ],
    "조항 핵심 목적": [
      "S3 접근 포인트 수준에서 퍼블릭 접근 차단이 설정되어 있는지 확인합니다.",
      "S3 버킷에 쓰기 권한이 공개적으로 부여되어 있으면 데이터 위변조 또는 삭제가 발생할 수 있습니다.",
      "S3 버킷이 ACL을 사용하지 않고 정책 기반 접근 제어를 사용하도록 설정되어 있는지 확인합니다.",
      "계정 수준에서 S3 퍼블릭 접근 차단 정책이 적용되어 있는지 확인합니다.",
      "버킷 수준에서 퍼블릭 접근 차단 정책이 적용되어 있는지 확인합니다.",
      "DocumentDB 클러스터 스냅샷이 퍼블릭으로 설정되어 있으면 민감 데이터 노출 우려가 있습니다.",
      "CloudFront 배포에 지리적 제한이 설정되어 있어 특정 국가에서의 접근을 제한할 수 있습니다.",
      "OpenSearch 도메인이 퍼블릭하게 노출되지 않도록 설정되어 있는지 점검합니다.",
      "Lightsail 인스턴스가 퍼블릭 IP를 통해 외부에서 접근 가능하도록 설정되어 있는지 확인합니다. 퍼블릭 인스턴스는 보안 위협에 노출될 가능성이 있으므로, 필요하지 않은 경우 비공개 설정을 권장합니다.",
      "Lightsail에서 생성된 데이터베이스 인스턴스가 외부 네트워크에서 접근 가능하지 않도록 퍼블릭 접근 설정을 비활성화해야 합니다. 데이터베이스는 민감 정보가 저장되므로 네트워크 접근을 엄격히 제한해야 합니다.",
      "Neptune 클러스터가 퍼블릭 서브넷을 사용하고 있는지 확인합니다. 퍼블릭 서브넷에 배치된 DB 인스턴스는 외부 공격에 노출될 수 있으므로, 사설 서브넷에 위치시키는 것이 권장됩니다.",
      "Neptune 클러스터의 스냅샷이 퍼블릭으로 설정되어 외부에서 접근 가능한 경우 민감한 데이터가 유출될 위험이 있으므로, 스냅샷 공유 설정을 제한해야 합니다.",
      "Elastic Container Registry(ECR)에 저장된 이미지가 퍼블릭으로 설정되어 있으면 누구나 해당 이미지를 pull 할 수 있으므로, 접근 권한을 최소화하고 비공개로 유지해야 합니다.",
      "AWS WorkSpaces 환경에서 프라이빗 서브넷과 퍼블릭 서브넷 구성이 적절해야 하며, NAT 게이트웨이 설정이 보안 요구사항을 충족하는지 확인해야 합니다.",
      "인터넷에 직접 연결된 ELB는 외부 공격 벡터가 될 수 있으므로 필요하지 않은 경우 내부 전용 로드 밸런서를 사용하는 것이 좋습니다.",
      "SQS 큐가 퍼블릭하게 노출될 경우 메시지 유출이나 악의적 요청을 유발할 수 있습니다. 큐 정책을 통해 액세스를 제한해야 합니다.",
      "Redshift 클러스터가 퍼블릭하게 노출되어 있다면 외부에서 DB 접근이 가능해져 데이터 유출 위험이 큽니다. 퍼블릭 IP를 비활성화하고 보안 그룹을 통해 통제해야 합니다.",
      "CloudTrail 로그를 저장하는 S3 버킷이 퍼블릭으로 노출되면 감사 정보가 외부에 유출될 수 있습니다. 퍼블릭 차단 설정이 반드시 필요합니다.",
      "Lambda 함수가 퍼블릭 URL을 통해 무제한 호출 가능한 상태면 서비스 남용과 비용 증가, 보안 이슈가 발생할 수 있습니다.",
      "Lambda의 URL 접근에 대한 CORS 정책이 너무 관대하면 외부 사이트로 정보가 유출될 수 있으므로 특정 오리진만 허용해야 합니다.",
      "Lambda 함수가 인증 없이 퍼블릭 접근 가능하면 악의적 사용자가 무단 실행할 수 있으므로 정책 기반 제어가 필요합니다.",
      "IAM 사용자에게 관리자 권한이 있는 경우 계정 탈취 시 전 계정 통제가 가능해져 위험이 큽니다. 최소 권한 원칙을 준수해야 합니다.",
      "관리자 권한이 부여된 그룹에 사용자가 많다면 광범위한 권한 확산 위험이 있습니다. 역할 기반 권한 분리가 필요합니다.",
      "콘솔 접근이 가능한 IAM 사용자에게 MFA가 설정되지 않은 경우 계정 탈취에 매우 취약합니다. MFA는 필수입니다.",
      "VPC 전체에 Network Firewall이 적용되어 있어야 내부망을 외부 위협으로부터 보호할 수 있습니다. 모든 VPC에 일관된 정책이 적용되어야 합니다.",
      "Amazon EKS 클러스터에서 네트워크 정책(Network Policy)이 활성화되어 있는지 확인합니다. 네트워크 정책은 파드 간 통신을 제어하여 애플리케이션 계층 보안을 강화하는 수단입니다. 활성화되어 있지 않으면 내부에서 불필요한 접근이 가능해질 수 있습니다.",
      "EKS 클러스터의 API 서버가 퍼블릭 IP를 통해 외부에서 접근 가능하지 않도록 설정되어야 합니다. 클러스터가 퍼블릭하게 노출될 경우, 인증 우회 또는 공격자의 브루트포싱 대상이 될 수 있습니다.",
      "EKS 클러스터의 노드 그룹이 프라이빗 서브넷 내에 배치되어 있는지 확인합니다. 퍼블릭 노드는 외부 공격자에게 노출되어 위험하며, 프라이빗 설정 시 NAT를 통해 제한된 외부 통신만 허용됩니다.",
      "EKS 클러스터의 API 서버가 퍼블릭 IP를 통해 외부에서 접근 가능하지 않도록 설정되어야 합니다. 클러스터가 퍼블릭하게 노출될 경우, 인증 우회 또는 공격자의 브루트포싱 대상이 될 수 있습니다.",
      "VPC 피어링이 설정된 경우, 라우팅 테이블이 최소 권한 원칙에 따라 접근 경로만 허용하도록 설정되어 있어야 하며, 불필요한 VPC 간 통신을 차단해야 합니다.",
      "VPC 서브넷이 기본적으로 퍼블릭 IP를 할당하지 않도록 설정되어 있어야 하며, 퍼블릭 IP는 명시적으로 필요할 때만 부여해야 합니다. 이는 클라우드 인스턴스의 무분별한 외부 노출을 방지합니다.",
      "VPC 엔드포인트 서비스에 접근할 수 있는 IAM 주체(Principal)를 명확히 제한하고, 신뢰할 수 있는 엔터티만 접근할 수 있도록 설정하는 것이 중요합니다.",
      "VPC 엔드포인트 연결이 신뢰 경계(trust boundary)를 넘지 않도록 설계되어야 하며, 의도하지 않은 외부 네트워크에서의 접근을 제한해야 합니다.",
      "VPC 내에서 프라이빗 서브넷과 퍼블릭 서브넷이 명확히 구분되어야 하며, 중요 자산은 반드시 프라이빗 서브넷에 배치되어야 합니다.",
      "AWS Database Migration Service(DMS) 인스턴스가 외부에서 직접 접근 가능하지 않도록 설정되어야 합니다. DMS는 민감한 데이터 이전에 사용되므로 사설 서브넷에 배치하고 접근 제한이 필요합니다.",
      "Application Load Balancer 또는 Network Load Balancer가 인터넷 연결형(internet-facing)으로 설정되어 있으면 외부에서 접근 가능하게 되어 보안 위험이 증가합니다. 내부 서비스 전용이라면 internal 타입으로 설정해야 합니다.",
      "ELBv2 리스너 설정이 최소 권한 원칙에 따라 구성되어야 하며, 포트와 프로토콜에 대한 제어를 통해 불필요한 노출을 방지해야 합니다.",
      "ElastiCache 클러스터가 퍼블릭 서브넷에 배치된 경우, 외부 공격에 노출될 수 있으며 Redis 또는 Memcached 데이터가 유출될 수 있습니다. 반드시 프라이빗 서브넷에 배치하고 접근 제한을 설정해야 합니다.",
      "AppStream 사용자 세션의 최대 지속 시간 설정은 세션 장기 유지로 인한 보안 사고 방지에 도움이 됩니다. 적절한 세션 타임아웃을 설정해야 합니다.",
      "AppStream 플릿에 기본 인터넷 접근이 비활성화되어야 내부 자산 보호 및 웹 공격 노출을 방지할 수 있습니다.",
      "사용자 세션이 일정 시간 동안 비활성 상태일 때 자동으로 종료되도록 설정해야 하며, 이를 통해 리소스 낭비 및 보안 위협을 줄일 수 있습니다.",
      "AppStream 세션이 사용자와 연결이 끊어진 후 일정 시간 내에 종료되도록 설정하여, 세션 하이재킹 등의 위협을 방지해야 합니다.",
      "Amazon RDS 스냅샷이 퍼블릭으로 공개되면 데이터베이스 백업 이미지가 외부에 노출될 수 있어 매우 위험합니다. 스냅샷 공유 설정은 특정 AWS 계정에만 제한해야 합니다.",
      "RDS 인스턴스가 퍼블릭 IP를 통해 외부에서 접근 가능하지 않도록 설정해야 하며, 외부 연결은 프록시 또는 VPN을 통해 제한적으로 허용해야 합니다.",
      "RDS 이벤트 구독 시 관련된 보안 그룹 설정이 적절히 구성되어 있어야 하며, 의심스러운 이벤트 발생 시 즉각 대응할 수 있도록 해야 합니다.",
      "IAM을 통한 RDS 인증을 활성화하면 비밀번호 대신 IAM 정책을 통해 사용자 접근을 제어할 수 있어 보다 안전한 인증 체계를 갖출 수 있습니다.",
      "API Gateway가 퍼블릭하게 설정되어 있으면 인증되지 않은 사용자도 API에 접근할 수 있습니다. 민감한 데이터 처리 API는 비공개로 구성해야 합니다.",
      "API Gateway에서 Lambda Authorizer나 Cognito User Pools를 통해 사용자 인증 기능이 활성화되어야 하며, 이를 통해 인증된 사용자만 API에 접근하도록 제한할 수 있습니다.",
      "API Gateway가 퍼블릭하게 열려 있지만, Authorizer로 인증이 설정된 경우입니다. 공개된 API라도 인증 절차가 포함되어야 하며, 인증 실패 시 접근을 차단해야 합니다.",
      "SageMaker 훈련 작업에서 네트워크 격리(Network Isolation)가 활성화되어야 외부 인터넷과의 연결을 차단할 수 있습니다. 이를 통해 외부 악성 코드 유입, 데이터 유출 등을 예방하고, 데이터 보안 및 규제 요건을 충족할 수 있습니다.",
      "SageMaker에서 배포되는 모델이 VPC 내에서 실행되도록 구성해야 합니다. 이를 통해 모델이 외부 인터넷과 격리되고, 인바운드/아웃바운드 트래픽이 보안 그룹 및 네트워크 ACL로 제어됩니다.",
      "SageMaker 훈련 작업이 VPC 내에서 수행되도록 설정하면, 내부 자원에만 접근하도록 제한되며, 외부 노출을 최소화할 수 있어 보안상 유리합니다.",
      "SageMaker 모델 실행 시 네트워크 격리(Network Isolation)를 설정하면 외부에서 해당 모델에 접근할 수 없게 되며, API 호출 등을 통한 무단 접근을 차단할 수 있습니다.",
      "SageMaker 노트북 인스턴스가 직접적인 인터넷 접속을 하지 않도록 구성해야 외부 위협으로부터 보호됩니다. 필요 시 NAT Gateway 또는 VPC Endpoint를 통한 제한된 접근만 허용해야 합니다.",
      "노트북 인스턴스가 VPC 내에서 실행되도록 설정되면, 외부 네트워크와의 연결이 제어 가능해지고, 민감한 데이터 작업 시 보안성을 확보할 수 있습니다.",
      "LDAP 포트(389, 636)가 외부에 노출되어 있으면 인증 정보가 평문으로 유출될 위험이 있으며, 인증 서버가 외부 공격자의 표적이 될 수 있습니다.",
      "퍼블릭 인터넷에서 모든 포트로 인바운드 트래픽을 허용하는 보안 그룹은 시스템 전체를 외부 공격에 노출시킵니다. 최소 권한 원칙에 따라 포트 접근을 제한해야 합니다.",
      "Kerberos 포트(88 등)가 외부에 노출되면 인증 요청을 위조하거나 공격할 수 있는 기회를 제공하게 되어, 내부 인증 체계가 위협받을 수 있습니다.",
      "사용되지 않는 보안 그룹이 계속 존재하면 추후 실수로 연결되거나 규정을 벗어난 구성이 될 수 있으므로, 미사용 보안 그룹은 삭제하는 것이 바람직합니다.",
      "Cassandra 관련 포트가 외부에 개방되어 있는 경우, 데이터베이스 관리 포트에 대한 무단 접근 가능성이 높습니다.",
      "기본 보안 그룹의 설정이 허용적인 경우, 모든 EC2 인스턴스가 과도하게 네트워크에 노출될 수 있으므로 기본 보안 그룹은 최소 권한으로 설정해야 합니다.",
      "CIFS/SMB 프로토콜(포트 445 등)은 윈도우 파일 공유에 사용되며, 외부 노출 시 랜섬웨어 등의 공격에 취약합니다.",
      "Kafka의 기본 포트(9092 등)가 인터넷에 노출되면 메시지 브로커를 통한 민감 데이터 유출 및 인증 우회 가능성이 있습니다.",
      "Oracle 데이터베이스 포트가 외부에 노출되면 공격자가 SQL 인젝션이나 브루트포싱 공격을 시도할 수 있습니다.",
      "MySQL 포트(3306)가 퍼블릭하게 열려 있으면 인증 없이 DB에 접근할 수 있으며, 중요한 데이터가 유출될 위험이 있습니다.",
      "Kafka 브로커에 대한 TCP 9092 포트 접근 허용은 시스템 간 메시지 전송의 신뢰성을 무너뜨릴 수 있습니다.",
      "MongoDB 포트가 외부에 열려 있을 경우 인증되지 않은 사용자의 데이터 조회 및 삭제 공격이 가능합니다.",
      "SSH 포트(22)가 열려 있으면 무차별 로그인 공격(Brute Force Attack)에 노출되므로, 보안 그룹과 키 기반 인증으로 보호해야 합니다.",
      "PostgreSQL 데이터베이스에 대한 퍼블릭 접근은 인증 우회, 쿼리 삽입 등의 공격 경로가 될 수 있습니다.",
      "Elastic IP가 검색 엔진(Shodan)에 노출되어 있다면 해당 인스턴스가 이미 인터넷상에서 탐지되고 있어 공격자가 악용할 가능성이 큽니다.",
      "RDP 포트(3389)가 인터넷에 개방되면 원격 데스크톱 접속을 통한 시스템 장악 시도가 가능하므로, VPN 또는 제한된 IP만 허용해야 합니다.",
      "Redis는 인증 없이 접근 가능한 구조이며, 퍼블릭 접근 시 시스템 설정이 조작되거나 비밀번호가 유출될 수 있습니다.",
      "0.0.0.0/0로 모든 IPv4 주소를 허용하는 보안 그룹은 사실상 방화벽이 없는 상태로, 침해사고 위험이 매우 높습니다.",
      "Cassandra DB의 외부 노출은 클러스터 구조 파악, 관리 포트 접근, 데이터 유출 등의 위협을 초래할 수 있습니다.",
      "Telnet은 평문 통신을 사용하는 구식 프로토콜로, 포트 23이 열려 있을 경우 자격 증명 탈취와 세션 하이재킹의 위험이 있습니다.",
      "SQL Server의 포트가 외부에 노출될 경우, 인증 우회, 취약점 스캐닝, 데이터 유출 위험이 증가합니다.",
      "Memcached 서비스가 외부에 노출되면 DDoS 증폭 공격에 악용될 수 있으며, 내부 데이터 캐시가 외부로 유출될 수 있습니다.",
      "네트워크 ACL에서 모든 포트에 대해 인바운드 트래픽을 허용하는 설정은 외부의 무차별 공격에 취약해지며, 네트워크 기반 탐색 및 스캔 도구에 쉽게 노출됩니다.",
      "MySQL 데이터베이스 포트 3306이 인터넷에 개방되면 인증되지 않은 사용자도 접근할 수 있어 데이터 유출 및 권한 상승 가능성이 존재합니다.",
      "퍼블릭 EBS 스냅샷은 모든 AWS 사용자에게 해당 데이터 볼륨의 내용을 복원할 수 있게 해 정보 유출로 이어질 수 있습니다.",
      "RDP 포트(3389)를 허용하는 ACL 설정은 원격 데스크톱 공격에 취약해지며, 내부 시스템 제어권 탈취로 이어질 수 있습니다.",
      "VPC 연결 요청을 자동으로 수락하는 Transit Gateway 설정은 악의적인 VPC 연결을 허용할 수 있어 신뢰 경계가 붕괴될 수 있습니다.",
      "PostgreSQL 포트(5432)가 퍼블릭하게 열려 있는 경우 인증 우회, 취약점 악용 등의 경로로 시스템 침해가 발생할 수 있습니다.",
      "FTP는 평문으로 사용자 인증 정보를 주고받으며, 포트 20/21이 외부에 노출될 경우 계정 탈취와 데이터 변조 위험이 있습니다.",
      "과도한 인바운드 및 아웃바운드 규칙을 가진 보안 그룹은 관리가 복잡해지고 오탐 및 누락 위험이 높아지며, 최소 권한 원칙에 어긋납니다.",
      "공개된 AMI는 조직 내 민감 정보, 설정 등이 외부에 노출될 가능성이 있으며, 악의적 사용자가 동일 이미지를 활용할 수 있습니다.",
      "Oracle DB 포트가 외부에 노출되면 취약점 악용, 인증 우회, DB 서버 장악 시도가 가능하므로, 내부망 제한이 필요합니다.",
      "Elasticsearch 및 Kibana 포트가 외부에 노출되면 로그 분석 플랫폼의 정보 유출, 데이터 조작 위험이 커집니다.",
      "EC2 인스턴스에서 Instance Metadata Service v2(IMDSv2)를 활성화하지 않으면 SSRF(서버측 요청 위조) 취약점을 통해 권한 상승이 가능해집니다.",
      "SSH 포트 22가 외부에 개방된 경우 무차별 대입 공격(Brute Force)에 취약하며, 반드시 제한된 IP 또는 MFA와 함께 사용해야 합니다.",
      "Elasticsearch 및 Kibana의 기본 포트가 인터넷에 노출되면 무단 쿼리 실행, 시스템 메트릭 조회가 가능해 정보 수집에 악용될 수 있습니다.",
      "Redis 포트가 외부에 노출되면 인증 없는 접근이 가능하며, RCE(원격 명령 실행) 취약점이 존재할 수 있어 심각한 보안 위협이 됩니다.",
      "RDP 포트 3389를 외부에서 허용하면 원격 접속 공격 및 정보 수집 위험이 있어 반드시 접근 IP를 제한하거나 VPN을 통해 보호해야 합니다.",
      "MS SQL Server의 포트가 외부에 노출되면 인증 우회, 취약점 악용 등의 위협이 존재하여 내부망으로만 제한하는 것이 안전합니다.",
      "Memcached 포트 11211이 열려 있으면 공격자가 데이터 캐시를 조회하거나 DDoS 증폭 공격에 악용할 수 있습니다.",
      "FTP는 평문 프로토콜로서 포트 20/21이 노출되면 자격 증명 유출 위험이 있으며, FTPS나 SFTP로 대체해야 합니다.",
      "퍼블릭 IP가 EC2 인스턴스에 직접 할당되어 있는 경우, 인스턴스가 인터넷 공격에 직접 노출되므로 NAT Gateway 사용이 권장됩니다.",
      "네트워크 ACL에서 SSH 포트 22에 대해 인바운드를 허용하면 보안 그룹 외에도 레이어에서 추가 위험이 존재하게 됩니다.",
      "MongoDB 포트가 퍼블릭하게 열려 있으면 인증 없이 데이터 조작 및 삭제가 가능하므로, 반드시 사설망에 위치시켜야 합니다.",
      "모든 포트에 대한 접근을 허용하는 설정은 전체 시스템을 외부에 무방비로 노출시켜 해킹 및 랜섬웨어 피해를 유발할 수 있습니다.",
      "고위험 TCP 포트(예: 22, 3389, 3306 등)에 대한 외부 접근 허용은 취약점 스캐닝 및 익스플로잇 위험을 증가시킵니다.",
      "Telnet(포트 23)은 암호화되지 않은 통신을 사용하므로 외부에 노출될 경우 인증 정보가 쉽게 탈취당할 수 있습니다."
    ]
  },
  {
    "Id": "2.6.2",
    "Name": "",
    "Description": "",
    "Domain": "2. 보호대책 요구사항",
    "Subdomain": "\"2.6. 접근통제",
    "Section": "2.6.2 정보시스템 접근",
    "Checks": [
      "lightsail_instance_public",
      "lightsail_static_ip_unused",
      "ec2_securitygroup_allow_ingress_from_internet_to_any_port",
      "ec2_elastic_ip_unassigned",
      "ec2_securitygroup_default_restrict_traffic",
      "ec2_instance_port_ssh_exposed_to_internet",
      "ec2_elastic_ip_shodan",
      "ec2_instance_port_rdp_exposed_to_internet",
      "ec2_instance_internet_facing_with_instance_profile",
      "ec2_securitygroup_allow_wide_open_public_ipv4",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_telnet_23",
      "ec2_instance_managed_by_ssm",
      "ec2_networkacl_allow_ingress_any_port",
      "ec2_networkacl_allow_ingress_tcp_port_3389",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_ftp_port_20_21",
      "ec2_securitygroup_with_many_ingress_egress_rules",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_22",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_3389",
      "ec2_instance_port_ftp_exposed_to_internet",
      "ec2_instance_public_ip",
      "ec2_networkacl_allow_ingress_tcp_port_22",
      "ec2_securitygroup_allow_ingress_from_internet_to_all_ports",
      "ec2_securitygroup_allow_ingress_from_internet_to_high_risk_tcp_ports",
      "ec2_instance_port_telnet_exposed_to_internet"
    ],
    "AuditChecklist": [
      "서버, 네트워크시스템, 보안시스템 등 정보시스템별 운영체제(OS)에 접근이 허용되는 사용자, 접근 가능 위치, 접근 수단 등을 정의하여 통제하고 있는가?",
      "정보시스템에 접속 후 일정시간 업무처리를 하지 않는 경우 자동으로 시스템 접속이 차단되도록 하고 있는가?",
      "정보시스템의 사용목적과 관계 없는 서비스를 제거하고 있는가?",
      "주요 서비스를 제공하는 정보시스템은 독립된 서버로 운영하고 있는가?"
    ],
    "RelatedRegulations": [
      "개인정보 보호법 제29조(안전조치의무)",
      "개인정보의 안전성 확보조치 기준 제6조(접근통제)"
    ],
    "AuditEvidence": [
      "정보시스템 운영체제 계정 목록",
      "서버 보안 설정",
      "서버접근제어 정책(SecureOS 관리화면 등)",
      "서버 및 네트워크 구성도",
      "정보자산 목록"
    ],
    "NonComplianceCases": [
      "사례 1 : 사무실에서 서버관리자가 IDC에 위치한 윈도우 서버에 접근 시 터미널 서비스를 이용하여 접근하고 있으나, 터미널 서비스에 대한 세션 타임아웃 설정이 되어 있지 않아 장시간 아무런 작업을 하지 않아도 해당 세션이 차단되지 않는 경우",
      "사례 2 : 서버 간 접속이 적절히 제한되지 않아 특정 사용자가 본인에게 인가된 서버에 접속한 후 해당 서버를 경유하여 다른 인가받지 않은 서버에도 접속할 수 있는 경우",
      "사례 3 : 타당한 사유 또는 보완 대책 없이 안전하지 않은 접속 프로토콜(telnet, ftp 등)을 사용하여 접근하고 있으며, 불필요한 서비스 및 포트를 오픈하고 있는 경우",
      "사례 4 : 모든 서버로의 접근은 서버접근제어 시스템을 통하도록 접근통제 정책을 가져가고 있으나, 서버접근제어 시스템을 통하지 않고 서버에 접근할 수 있는 우회 경로가 존재하는 경우"
    ],
    "대응방안 - 커스토디안과 연계": [
      "퍼블릭 IP가 설정된 Lightsail 인스턴스를 탐지하고, 태깅 또는 운영자 알림을 통해 비공개 전환을 유도",
      "연결되지 않은 상태로 방치된 Lightsail 정적 IP를 탐지하여 비용 최적화 목적의 리소스 정리 유도",
      "0.0.0.0/0 또는 ::/0에 대해 전체 포트를 허용하는 보안 그룹 탐지 및 태깅/경고",
      "EC2에 연결되지 않은 상태로 남아 있는 Elastic IP를 탐지하여 비용 최적화 및 관리 대상 설정",
      "기본 보안 그룹(default)이 너무 광범위한 트래픽을 허용하는지 점검 (예: 전체 인바운드 허용)",
      "SSH 포트(22)가 퍼블릭 IP + 오픈된 SG 조합으로 외부 노출되어 있는 EC2 인스턴스를 탐지",
      "Shodan에 노출된 Elastic IP가 연결된 EC2 인스턴스를 탐지하여 외부 공격 노출 여부 파악",
      "RDP 포트(3389)가 외부 접근 가능한 상태인 EC2 인스턴스를 탐지",
      "퍼블릭 IP가 부여되고 IAM 인스턴스 프로파일이 연결된 인스턴스를 탐지하여 자격증명 노출 위험을 점검",
      "0.0.0.0/0 또는 ::/0에 대해 포트 전체 허용이 설정된 보안 그룹 탐지",
      "Telnet 포트(23)에 대해 인터넷 인바운드를 허용한 보안 그룹 탐지",
      "AWS Systems Manager(SMM) Agent에 의해 관리되지 않는 EC2 인스턴스를 탐지하여 운영 관리 대상 외 여부 파악",
      "Network ACL에서 전체 포트 범위를 허용한 규칙을 탐지 (보통 overly permissive)",
      "RDP 포트(3389)에 대해 모든 IP에 접근 허용한 ACL 엔트리 탐지",
      "FTP 포트(20, 21)에 대해 외부 접근 허용한 보안 그룹 탐지",
      "규칙 수가 과도하게 많은 보안 그룹 탐지 (예: 50개 이상), 관리 복잡도 증가 위험",
      "SSH 포트(22)를 인터넷에 개방한 보안 그룹 탐지",
      "RDP 포트(3389)를 인터넷에 개방한 보안 그룹 탐지",
      "FTP 포트(20, 21)가 퍼블릭 IP 및 오픈된 SG 조합으로 외부 노출된 인스턴스를 탐지",
      "퍼블릭 IP가 할당된 EC2 인스턴스를 탐지하고 비용 또는 보안 목적의 알림 또는 태깅 수행",
      "SSH 포트(22)가 허용된 Network ACL 엔트리를 탐지",
      "모든 포트를 외부에 허용한 보안 그룹 탐지 (보통 잘못된 설정)",
      "Telnet, Redis, RDP, Mongo 등 고위험 포트가 개방된 보안 그룹 탐지",
      "Telnet 포트(23)가 EC2 인스턴스에서 퍼블릭하게 노출된 경우 탐지"
    ],
    "조항 핵심 목적": [
      "Lightsail 인스턴스가 퍼블릭하게 노출되어 있으면, 기본 설정 상 방화벽이 약하고 접근 제어가 미흡한 경우가 많아 해킹 시도가 쉬워집니다. 외부에 노출된 인스턴스는 반드시 엄격한 접근 제어와 모니터링이 필요합니다.",
      "할당된 정적 IP가 인스턴스에 연결되지 않은 채 유휴 상태이면, 불필요한 과금이 발생할 수 있으며 외부에서 관리되지 않는 IP로 오용될 가능성이 있습니다.",
      "보안 그룹이 모든 포트에 대해 인터넷 인바운드를 허용하면 시스템 전체가 외부 위협에 노출됩니다. 이는 해킹, 데이터 유출, 악성 코드 유입 등의 심각한 위험을 초래합니다.",
      "Elastic IP가 EC2 인스턴스에 연결되지 않은 채 존재하면 불필요한 자원 낭비 및 과금이 발생하며, 오용 가능성도 존재합니다.",
      "기본 보안 그룹이 트래픽을 제한하지 않으면 모든 인스턴스가 외부와 내부 양측 모두로부터 무방비하게 노출될 수 있어 보안 리스크가 커집니다.",
      "SSH 포트(22)가 인터넷에 노출되면 무차별 대입 공격(Brute Force) 및 비밀번호 탈취 공격에 매우 취약해지므로 접근 제어가 필수입니다.",
      "Shodan.io와 같은 공개 스캐너에 Elastic IP가 수집되었다는 것은 해당 인스턴스가 외부에 노출되었으며, 악성 공격자가 사전에 스캔했을 가능성이 있음을 의미합니다.",
      "RDP(3389) 포트가 퍼블릭하게 열려 있으면 원격 데스크톱 접근을 통한 침해가 가능해지므로, 최소한 VPN이나 접근 제한 정책을 통해 보호해야 합니다.",
      "인터넷에 노출된 EC2 인스턴스가 IAM 인스턴스 프로파일을 보유한 경우, SSRF 등 간접 공격을 통해 권한 상승이 발생할 가능성이 있으므로 네트워크 격리와 정책 제어가 중요합니다.",
      "0.0.0.0/0으로 설정된 보안 그룹은 모든 외부 IP가 인스턴스에 접근할 수 있게 하여 보안 위협에 무방비하게 노출됩니다.",
      "Telnet(23)은 암호화되지 않은 통신을 사용하므로, 외부에 열려 있으면 자격 증명 탈취 및 명령 실행이 용이한 보안 취약점이 됩니다.",
      "Systems Manager(SSM)로 관리되는 인스턴스는 에이전트를 통해 명령을 받을 수 있으므로, 관리 채널이 암호화되어 있어야 하며 IAM 권한 구성도 중요합니다.",
      "네트워크 ACL이 모든 포트를 허용하는 경우, 보안 그룹 외의 레이어에서도 시스템 전체가 외부 노출되어 다중 방어 계층이 무력화됩니다.",
      "3389 포트를 허용하는 ACL은 RDP를 통한 원격 접근을 가능하게 하므로, 이 설정은 비인가 접근 경로가 될 수 있습니다.",
      "FTP는 평문 기반이며 포트 20/21이 외부에 열려 있으면 ID/PW 유출 및 파일 조작 위험이 존재하므로 FTPS/SFTP 전환이 권장됩니다.",
      "보안 그룹 규칙이 과도하면 관리가 어려워지고 예기치 못한 오픈 포트가 존재할 가능성이 커지므로 최소한의 룰 적용이 원칙입니다.",
      "SSH 포트는 인프라 운영의 핵심 경로이므로 외부에 열려 있다면 VPN, 키 인증, 제한된 IP를 통해 접근을 통제해야 합니다.",
      "RDP 포트는 윈도우 시스템 제어 권한과 직결되므로 외부 공개는 고위험이며, 접근 제한 및 2단계 인증이 필요합니다.",
      "FTP 포트가 외부에 열려 있으면 평문 전송으로 인해 데이터 유출 및 세션 하이재킹 등의 위협이 존재합니다.",
      "퍼블릭 IP는 인스턴스를 인터넷에 직접 노출시키므로 외부 공격의 대상이 되며, NAT Gateway 또는 VPN을 통한 우회가 보안상 권장됩니다.",
      "SSH 포트에 대해 ACL에서 허용한 경우, 보안 그룹과 병행해서 외부에서 시스템 접근이 가능해져 추가적인 보호가 필요합니다.",
      "모든 포트에 대한 외부 접근을 허용하면 시스템 전체가 무방비로 노출되어 악성 스캐닝, 해킹 시도, 자동화 공격에 취약해집니다.",
      "SSH, RDP, DB 등 주요 서비스 포트가 외부에 노출되면 보안 리스크가 급증하므로 접근 제한과 로그 분석이 병행되어야 합니다.",
      "Telnet은 암호화되지 않은 통신 방식으로 인가되지 않은 접근자가 손쉽게 내부 시스템을 탐색하거나 명령을 실행할 수 있어 비활성화가 권장됩니다."
    ]
  },
  {
    "Id": "2.6.4",
    "Name": "",
    "Description": "",
    "Domain": "2. 보호대책 요구사항",
    "Subdomain": "2.6. 접근통제",
    "Section": "2.6.4 데이터베이스 접근",
    "Checks": [
      "documentdb_cluster_public_snapshot",
      "opensearch_service_domains_internal_user_database_enabled",
      "opensearch_service_domains_use_cognito_authentication_for_kibana",
      "opensearch_service_domains_https_communications_enforced",
      "opensearch_service_domains_not_publicly_accessible",
      "accessanalyzer_enabled_without_findings",
      "accessanalyzer_enabled",
      "lightsail_database_public",
      "neptune_cluster_iam_authentication_enabled",
      "neptune_cluster_uses_public_subnet",
      "neptune_cluster_public_snapshot",
      "dynamodb_table_cross_account_access",
      "redshift_cluster_public_access",
      "vpc_subnet_separate_private_public",
      "dms_instance_no_public_access",
      "rds_cluster_iam_authentication_enabled",
      "rds_snapshots_public_access",
      "rds_instance_no_public_access",
      "rds_instance_iam_authentication_enabled",
      "rds_instance_transport_encrypted",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_cassandra_7199_9160_8888",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_oracle_1521_2483",
      "ec2_instance_port_mysql_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_port_mongodb_27017_27018",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_postgres_5432",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_redis_6379",
      "ec2_securitygroup_allow_wide_open_public_ipv4",
      "ec2_instance_port_cassandra_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_sql_server_1433_1434",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_mysql_3306",
      "ec2_networkacl_allow_ingress_tcp_port_3389",
      "ec2_instance_port_oracle_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_elasticsearch_kibana_9200_9300_5601",
      "ec2_instance_port_elasticsearch_kibana_exposed_to_internet",
      "ec2_instance_port_redis_exposed_to_internet",
      "ec2_instance_port_sqlserver_exposed_to_internet",
      "ec2_instance_port_mongodb_exposed_to_internet"
    ],
    "AuditChecklist": [
      "데이터베이스의 테이블 목록 등 저장·관리되고 있는 정보를 식별하고 있는가?",
      "데이터베이스 내 정보에 접근이 필요한 응용프로그램, 정보시스템(서버) 및 사용자를 명확히 식별하고 접근통제 정책에 따라 통제하고 있는가?"
    ],
    "RelatedRegulations": [
      "개인정보 보호법 제29조(안전조치의무)",
      "개인정보의 안전성 확보조치 기준 제5조(접근권한의 관리), 제6조(접근통제)"
    ],
    "AuditEvidence": [
      "데이터베이스 현황(테이블, 컬럼 등)",
      "데이터베이스 접속자 계정·권한 목록",
      "데이터베이스 접근제어 정책(데이터베이스 접근제어시스템 관리화면 등)",
      "네트워크 구성도(데이터베이스존 등)",
      "정보자산 목록"
    ],
    "NonComplianceCases": [
      "사례 1 : 대량의 개인정보를 보관·처리하고 있는 데이터베이스를 인터넷을 통하여 접근 가능한 웹 응용프로그램과 분리하지 않고 물리적으로 동일한 서버에서 운영하고 있는 경우",
      "사례 2 : 개발자 및 운영자들이 응응 프로그램에서 사용하고 있는 계정을 공유하여 운영 데이터베이스에 접속하고 있는 경우",
      "사례 3 : 내부 규정에는 데이터베이스의 접속권한을 오브젝트별로 제한하도록 되어 있으나, 데이터베이스 접근권한을 운영자에게 일괄 부여하고 있어 개인정보 테이블에 접근할 필요가 없는 운영자에게도 과도하게 접근 권한이 부여된 경우",
      "사례 4 : 데이터베이스 접근제어 솔루션을 도입하여 운영하고 있으나, 데이터베이스 접속자에 대한 IP주소 등이 적절히 제한되어 있지 않아 데이터베이스 접근제어 솔루션을 우회하여 데이터베이스에 접속하고 있는 경우",
      "사례 5 : 개인정보를 저장하고 있는 데이터베이스의 테이블 현황이 파악되지 않아, 임시로 생성된 테이블에 불필요한 개인정보가 파기되지 않고 대량으로 저장되어 있는 경우"
    ],
    "대응방안 - 커스토디안과 연계": [
      "DocumentDB 수동 스냅샷이 공개 상태인지 점검하여 'restore access'를 제거하거나 태깅",
      "OpenSearch의 내부 사용자 인증 데이터베이스가 활성화된 경우 탐지하여 IAM/Cognito 사용 권고",
      "Kibana 접근에 Cognito 인증을 사용하지 않는 경우 탐지하여 알림 또는 설정 변경 유도",
      "OpenSearch 도메인이 HTTPS만 허용하도록 설정되어 있는지 확인하고 미적용 시 경고",
      "Public endpoint 설정이 활성화된 OpenSearch 도메인을 탐지하고 비공개 전환 유도",
      "Access Analyzer가 활성화되었으나 최근 이상 탐지가 없는 경우 분석 정확성 또는 비활성화 상태 점검",
      "Access Analyzer 자체가 비활성화되어 있는 경우 탐지하고 알림",
      "퍼블릭 엔드포인트가 설정된 Lightsail DB 인스턴스를 탐지하고 태깅 또는 알림",
      "IAM 인증이 비활성화된 Neptune 클러스터를 탐지하고 운영자에게 경고",
      "Neptune 클러스터가 퍼블릭 서브넷에 배치되어 인터넷에 노출될 가능성 탐지",
      "Neptune 수동 스냅샷이 퍼블릭 설정인 경우 탐지 및 비공개 전환",
      "DynamoDB 테이블에 대해 다른 AWS 계정에서 접근 가능한 리소스 정책이 적용된 경우 탐지",
      "퍼블릭 접근을 허용한 Redshift 클러스터를 탐지하고 비공개로 설정 유도",
      "VPC 서브넷이 퍼블릭과 프라이빗으로 명확히 분리되지 않은 경우 탐지 (IGW/NAT 사용 기준 분석)",
      "퍼블릭 IP가 할당된 DMS 인스턴스를 탐지하고 태깅 또는 알림",
      "RDS 클러스터에서 IAM 인증이 활성화되어 있지 않은 경우 탐지",
      "RDS 수동 스냅샷이 공개 상태인 경우 탐지하고 restore 권한 제거",
      "퍼블릭 접근이 허용된 RDS 인스턴스를 탐지하고 비공개로 전환 권고",
      "RDS 인스턴스에서 IAM 인증이 비활성화된 경우 탐지",
      "RDS 인스턴스에서 TLS 암호화가 비활성화된 경우 탐지하고 경고",
      "Cassandra 포트가 인터넷에서 접근 가능한 보안 그룹 탐지 (0.0.0.0/0 + 포트 매칭)",
      "Oracle 포트에 대해 외부 접근 허용된 보안 그룹을 탐지",
      "MySQL 포트(3306)가 퍼블릭 IP를 통해 외부에 노출된 인스턴스를 탐지",
      "MongoDB 포트가 공개 접근 가능한 상태인지 보안 그룹 기준으로 탐지",
      "PostgreSQL 포트가 외부 접근 가능한 보안 그룹에 의해 노출되었는지 탐지",
      "Redis 포트(6379)가 외부에 열려 있는 SG 탐지",
      "보안 그룹에서 0.0.0.0/0에 대해 모든 포트를 허용한 overly permissive 설정 탐지",
      "Cassandra 포트가 퍼블릭 IP + 오픈 SG로 EC2에서 노출되었는지 탐지",
      "SQL Server 포트에 대해 외부 인바운드를 허용한 보안 그룹 탐지",
      "MySQL 포트가 외부 접근 가능한 SG를 통해 개방된 경우 탐지",
      "RDP 포트(3389)를 외부에서 접근 가능한 Network ACL 엔트리를 탐지",
      "Oracle 포트가 퍼블릭으로 노출된 EC2 인스턴스를 탐지",
      "Elasticsearch 및 Kibana 포트가 외부에 개방된 SG 탐지",
      "Elasticsearch/Kibana 포트가 퍼블릭 IP와 함께 노출된 EC2 탐지",
      "Redis 포트가 EC2에서 퍼블릭하게 노출된 상태인지 탐지",
      "SQL Server 포트가 퍼블릭 IP를 통해 외부에 노출된 EC2 인스턴스 탐지",
      "MongoDB 포트가 EC2 인스턴스에서 퍼블릭하게 접근 가능한 상태인지 탐지"
    ],
    "조항 핵심 목적": [
      "수동 생성된 DocumentDB 스냅샷이 퍼블릭으로 설정되었는지 확인합니다. 퍼블릭이면 다른 계정이 스냅샷을 복원할 수 있어 데이터 유출 위험이 있습니다.",
      "OpenSearch 도메인에 대해 내부 사용자 데이터베이스가 활성화되었는지 확인합니다. 내부 사용자 인증을 사용하면 IAM 또는 Cognito 없이 로그인 가능하므로 최소 권한 설정이 중요합니다.",
      "Kibana(또는 Dashboards) 접근에 대해 Cognito 기반 인증이 설정되어 있는지 점검합니다. 외부 사용자 인증 없이 Kibana에 접근하는 것은 보안상 취약합니다.",
      "HTTPS를 통한 통신만 허용되도록 강제되어 있는지 확인합니다. HTTP를 허용하면 암호화되지 않은 트래픽으로 정보가 유출될 수 있습니다.",
      "도메인이 공개 접근(Public access) 을 허용하지 않도록 설정되어 있는지 점검합니다. 공개되면 누구든지 OpenSearch API나 Kibana에 접근할 수 있어 위험합니다.",
      "Access Analyzer가 활성화되어 있고 이상 탐지 없음 상태인지 확인합니다. 설정되어 있지만 사용 중이 아닌 경우에도 점검 대상입니다.",
      "조직 또는 계정 단위에서 Access Analyzer가 활성화되어 있는지 여부를 점검합니다. 설정되어 있지 않으면 외부 접근 권한 탐지가 불가합니다.",
      "Lightsail 데이터베이스 인스턴스가 퍼블릭하게 노출되어 있는지 확인합니다. 공용 IP로 노출된 DB는 공격 대상이 될 수 있습니다.",
      "Neptune DB에 IAM 인증이 설정되어 있는지 점검합니다. IAM 인증은 비밀번호 대신 IAM 자격 증명을 사용하므로 더 안전합니다.",
      "퍼블릭 서브넷 내에 Neptune 클러스터가 배치되었는지 확인합니다. 퍼블릭 서브넷은 인터넷과 연결될 수 있어 위험합니다.",
      "수동 Neptune 스냅샷이 공개 설정되어 있는지 확인합니다. 다른 계정에서 스냅샷 복원이 가능해져 데이터 유출 위험이 있습니다.",
      "테이블 정책에서 다른 AWS 계정에 대한 접근 권한이 설정되어 있는지 확인합니다. 의도치 않은 데이터 노출을 방지해야 합니다.",
      "Redshift 클러스터가 퍼블릭 접근을 허용하는지 확인합니다. 공개 IP 또는 퍼블릭 SG가 설정되어 있으면 위험합니다.",
      "퍼블릭 서브넷과 프라이빗 서브넷이 동일한 라우팅 테이블을 공유하거나, 동일한 NAT/인터넷 게이트웨이에 연결되어 있는지 여부 등을 분석함",
      "DMS 복제 인스턴스가 퍼블릭 IP로 노출되어 있는지 점검합니다. 비공개 서브넷 내 배치를 권장합니다.",
      "RDS (Aurora 포함) 클러스터에 IAM 인증이 활성화되어 있는지 점검합니다. 인증 보안을 강화하기 위해 권장됩니다.",
      "수동 RDS 스냅샷이 퍼블릭으로 공유되었는지 확인합니다. 공개되면 타 계정에서 스냅샷을 복원할 수 있어 위험합니다.",
      "RDS 인스턴스가 퍼블릭 IP를 사용하거나 퍼블릭 SG로 노출되어 있는지 점검합니다. 인터넷 접근은 피해야 합니다.",
      "RDS에 IAM 기반 인증이 설정되어 있는지 점검합니다.",
      "RDS가 암호화된 전송(TLS) 을 강제하고 있는지 점검합니다. 비암호화 접속은 정보 유출 위험이 있습니다.",
      "0.0.0.0/0 전체 공개 IP에 대해 모든 포트를 허용하는 SG가 존재하는지 점검합니다. 극도로 위험한 설정입니다.",
      "RDP 포트(3389)에 대해 모든 IP 접근을 허용하는지 확인합니다. 원격 접속이 가능해져 보안 위험이 큽니다.",
      "MySQL(3306포트)이 열려 있고, 해당 인스턴스에 퍼블릭 IP가 할당되어 있으며, 보안 그룹이 외부 접근 허용인 경우 이 체크에 해당됩니다.",
      "MongoDB의 기본 포트(27017, 27018)에 대한 공개 접근을 허용하는 인바운드 규칙이 있는지 점검합니다. MongoDB는 기본 설정이 비밀번호 없이 접속 가능한 경우가 많아 공격자가 자유롭게 접근할 수 있습니다.",
      "PostgreSQL의 기본 포트(5432)에 대해 인터넷 접근이 가능한 보안 그룹 규칙이 있는지 확인합니다. PostgreSQL도 다양한 인증 방식이 존재하지만, 퍼블릭 접근이 허용되면 Brute-force 공격, 데이터 조작 위험이 발생합니다.",
      "Redis 포트(6379)에 대한 공개 접근 허용 여부를 점검합니다. Redis는 기본적으로 인증 없이 열려 있으며, 외부에 노출되면 원격 명령 실행, 시스템 탈취, 서비스 중단 위험이 매우 큽니다.",
      "전체 퍼블릭 IPv4 (0.0.0.0/0) 에 대해 모든 포트 또는 너무 넓은 범위를 허용하는 보안 그룹을 탐지합니다. 이 항목은 포트와 프로토콜 무관하게 보안 그룹이 과도하게 개방되어 있는지를 점검하는 항목입니다.",
      "Cassandra의 포트(7199, 9160, 8888)가 열려 있으며, 퍼블릭 IP가 할당된 EC2 인스턴스에 외부 접근이 가능한 상태인지를 확인합니다. 보안 그룹뿐 아니라 NACL, 라우팅 테이블, 서브넷 설정도 함께 고려합니다.",
      "SQL Server의 포트(1433, 1434)에 대해 인터넷에서 접근 가능한 인바운드 규칙이 설정되어 있는지 확인합니다. Windows 기반 인프라에서 자주 사용되며, 기본 포트 그대로 사용하는 경우 공격 표적이 되기 쉽습니다.",
      "MySQL 포트(3306)에 대해 인터넷에서 접근 가능한 규칙이 설정되어 있는지 확인합니다. 위 ec2_instance_port_mysql_exposed_to_internet과는 보안 그룹 기준이라는 점에서 다릅니다.",
      "RDP 포트(3389)에 대해 퍼블릭 접근을 허용하는 네트워크 ACL 규칙이 있는지를 확인합니다. Windows 원격 접속을 위해 많이 사용되며, 해커들이 RDP 포트를 주기적으로 스캔하기 때문에 공개하면 위험합니다.",
      "Oracle 포트(1521, 2483)가 열려 있으며 EC2 인스턴스가 퍼블릭 IP를 사용 중이고 외부 접근이 가능한 경우를 점검합니다.",
      "Elasticsearch/Kibana 관련 포트(9200, 9300, 5601)가 외부에 개방되어 있는지 점검합니다. Elasticsearch는 인증 없이 데이터를 조회할 수 있어 공개 시 데이터가 통째로 유출될 수 있습니다.",
      "Elasticsearch/Kibana가 EC2에서 실행되고 있으며 퍼블릭 IP를 통해 외부 접근이 가능한 경우를 탐지합니다.",
      "Redis 포트(6379)가 열려 있고 퍼블릭 IP가 할당된 인스턴스가 외부에서 접근 가능한 상태인지를 점검합니다.",
      "SQL Server 포트(1433, 1434)가 퍼블릭 IP를 통해 외부에서 접근 가능한 경우입니다.",
      "MongoDB 포트(27017, 27018)가 열려 있으며 퍼블릭 접근이 가능한 경우를 점검합니다. MongoDB는 비인증 상태로 노출되면 데이터 전체가 유출될 수 있습니다."
    ]
  },
  {
    "Id": "2.6.6",
    "Name": "",
    "Description": "",
    "Domain": "",
    "Subdomain": "",
    "Section": "",
    "Checks": [
      "cloudwatch_log_metric_filter_authentication_failures\"",
      "cloudwatch_log_metric_filter_sign_in_without_mfa",
      "cognito_identity_pool_guest_access_disabled",
      "cognito_user_pool_mfa_enabled",
      "cognito_user_pool_self_registration_disabled",
      "workspaces_vpc_2private_1public_subnets_nat",
      "workspaces_volume_encryption_enabled",
      "iam_user_console_access_unused",
      "iam_user_mfa_enabled_console_access",
      "networkfirewall_in_all_vpc",
      "vpc_subnet_no_public_ip_by_default",
      "vpc_flow_logs_enabled",
      "vpc_subnet_separate_private_public",
      "appstream_fleet_maximum_session_duration",
      "appstream_fleet_default_internet_access_disabled",
      "appstream_fleet_session_idle_disconnect_timeout",
      "appstream_fleet_session_disconnect_timeout",
      "ec2_client_vpn_endpoint_connection_logging_enabled",
      "ec2_securitygroup_allow_ingress_from_internet_to_any_port",
      "ec2_instance_port_ssh_exposed_to_internet",
      "ec2_instance_port_rdp_exposed_to_internet",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_22",
      "ec2_securitygroup_allow_ingress_from_internet_to_tcp_port_3389",
      "ec2_networkacl_allow_ingress_any_port",
      "ec2_networkacl_allow_ingress_tcp_port_3389",
      "ec2_networkacl_allow_ingress_tcp_port_22"
    ],
    "AuditChecklist": [],
    "RelatedRegulations": [],
    "AuditEvidence": [],
    "NonComplianceCases": [],
    "대응방안 - 커스토디안과 연계": [
      "인증 실패 이벤트에 대한 CloudWatch Logs 필터 및 메트릭 알람 설정 여부 점검",
      "MFA 없이 콘솔 로그인 시도를 감지하는 로그 필터 및 경고 메트릭 설정 여부 점검",
      "Cognito Identity Pool에서 게스트(비인증 사용자) 접근 허용 여부 점검 및 비활성화",
      "Cognito 사용자 풀에 다중 인증(MFA)이 설정되어 있는지 탐지하고 미적용 시 알림",
      "Cognito 사용자 풀에서 자가 회원가입(사용자 등록)이 비활성화되어 있는지 확인",
      "워크스페이스가 프라이빗 서브넷 2개와 퍼블릭 서브넷 1개, NAT 설정으로 구성되어 있는지 점검",
      "워크스페이스 볼륨 암호화(EBS)가 활성화되지 않은 경우 탐지 및 경고",
      "콘솔 접근 권한이 있으나 장기간 사용되지 않은 IAM 사용자를 탐지하고 권한 제거 또는 알림",
      "콘솔 접근 권한이 있는 사용자에 대해 MFA가 설정되지 않은 경우 탐지",
      "VPC에 AWS Network Firewall이 구성되지 않은 경우 탐지",
      "서브넷에서 Launch 시 기본 퍼블릭 IP 할당이 비활성화되어 있는지 확인",
      "VPC 또는 서브넷 수준에서 VPC Flow Logs가 활성화되어 있는지 탐지",
      "퍼블릭/프라이빗 서브넷이 NAT, IGW 기준으로 적절히 분리되어 있는지 탐지",
      "AppStream Fleet에서 세션 최대 지속 시간이 과도하게 길게 설정된 경우 탐지",
      "AppStream Fleet에서 기본 인터넷 접근이 허용되어 있는지 탐지하고 차단",
      "AppStream Fleet에서 비활성 사용자에 대한 자동 세션 종료 시간이 설정되어 있는지 확인",
      "사용자 연결이 끊긴 세션에 대해 일정 시간 후 자동 종료 설정이 되어 있는지 점검",
      "EC2 Client VPN에서 접속 로깅이 설정되어 있는지 확인",
      "보안 그룹에서 모든 포트를 0.0.0.0/0 또는 ::/0에 개방한 경우 탐지",
      "SSH 포트(22)가 외부에 노출된 인스턴스를 탐지 (퍼블릭 IP + 오픈 SG)",
      "RDP 포트(3389)가 퍼블릭하게 노출된 인스턴스를 탐지",
      "SSH 포트를 외부에서 허용한 보안 그룹 탐지",
      "RDP 포트를 외부에서 허용한 보안 그룹 탐지",
      "모든 포트를 허용하는 Network ACL 인바운드 규칙 탐지",
      "RDP 포트를 허용하는 ACL 인바운드 규칙 탐지",
      "SSH 포트를 허용하는 ACL 인바운드 규칙 탐지"
    ],
    "조항 핵심 목적": [
      "CloudWatch 로그에서 인증 실패 이벤트를 필터링하여 감지함으로써 계정 탈취나 비인가 접근 시도를 조기에 식별할 수 있도록 구성합니다.",
      "MFA 없이 콘솔 로그인한 이벤트를 감지하여 다중 인증 미적용 상태를 파악하고 강화된 인증 정책 적용을 유도합니다.",
      "Cognito ID 풀에서 게스트 접근을 비활성화함으로써 인증되지 않은 사용자 접근을 차단합니다.",
      "Cognito 사용자 풀에서 MFA를 활성화하여 계정 도용이나 인증 우회를 방지합니다.",
      "사용자 직접 가입 기능을 비활성화하여 무작위 계정 생성과 자동화된 봇 공격을 방지합니다.",
      "WorkSpaces 네트워크를 2개의 프라이빗과 1개의 퍼블릭 서브넷으로 분리하여 내부망은 NAT를 통해서만 외부와 연결되도록 설정합니다.",
      "WorkSpaces 사용자 디스크가 암호화되지 않으면 데이터 유출 및 물리적 장비 탈취 위험이 있으므로 암호화를 필수로 설정합니다.",
      "콘솔 접근 권한이 부여되어 있으나 장기간 미사용된 IAM 사용자를 식별하여 비활성화하거나 권한 축소를 유도합니다.",
      "콘솔 로그인 가능한 모든 IAM 사용자에 대해 MFA를 활성화하여 단일 인증만으로 계정에 접근할 수 없도록 합니다.",
      "모든 VPC에 AWS Network Firewall을 배치하여 트래픽 필터링, 서명 기반 감지 등 고급 네트워크 보안 기능을 적용합니다.",
      "퍼블릭 IP 자동 할당을 기본적으로 비활성화함으로써 신규 인스턴스가 자동으로 인터넷에 노출되는 것을 방지합니다.",
      "VPC의 모든 트래픽 로그를 활성화하여 실시간 이상 징후 탐지와 포렌식 대응에 활용할 수 있도록 합니다.",
      "공용 자산과 민감 자산이 혼재되지 않도록 서브넷을 명확히 분리하여 접근통제를 강화합니다.",
      "AppStream 세션 지속 시간을 제한하여 장시간 방치된 세션의 하이재킹 위험을 낮춥니다.",
      "AppStream 플릿은 기본적으로 인터넷 접근이 차단되어야 하며, 필요시 예외적으로 허용해야 합니다.",
      "비활성 세션을 자동으로 종료하여 리소스 낭비를 막고 보안도 강화합니다.",
      "연결이 끊긴 세션도 자동으로 종료되도록 하여 시스템 자원과 보안 모두를 보호합니다.",
      "Client VPN 연결에 대한 로그를 활성화하여 외부 접속 기록을 감사 추적할 수 있도록 설정합니다.",
      "모든 포트에 대해 외부에서 접속 가능하면 침해 위험이 매우 높아 최소 권한 원칙에 위배됩니다.",
      "SSH(22번 포트)가 인터넷에 열려 있는 경우 무차별 대입 공격 및 인증 우회 시도의 표적이 될 수 있습니다.",
      "RDP(3389 포트)가 공개되면 윈도우 인스턴스가 원격 공격의 위험에 노출됩니다.",
      "22번 포트에 대한 퍼블릭 접근이 허용되어 있다면 공격자가 SSH를 통해 직접 접속을 시도할 수 있습니다.",
      "윈도우 인스턴스의 기본 원격 데스크탑 포트가 공개되어 있으면 악의적 원격 제어 시도가 발생할 수 있습니다.",
      "NACL이 모든 포트에 대해 인바운드 트래픽을 허용하면 실질적인 방화벽 역할을 수행하지 못합니다.",
      "NACL에서 3389 포트를 허용하면 모든 IP에서 윈도우 인스턴스로의 접근이 가능해져 위험합니다.",
      "SSH 포트가 네트워크 ACL에서 열려 있다면 IP 기반 접근제어를 무력화할 수 있어 위험합니다."
    ]
  },
  {
    "Id": "2.6.7",
    "Name": "",
    "Description": "",
    "Domain": "2. 보호대책 요구사항",
    "Subdomain": "2.6. 접근통제",
    "Section": "2.6.7 인터넷 접속 통제",
    "Checks": [
      "cloudwatch_changes_to_network_route_tables_alarm_configured",
      "cloudwatch_changes_to_network_gateways_alarm_configured",
      "cloudwatch_changes_to_vpcs_alarm_configured",
      "cloudwatch_changes_to_network_acls_alarm_configured",
      "workspaces_vpc_2private_1public_subnets_nat",
      "workspaces_volume_encryption_enabled",
      "networkfirewall_in_all_vpc",
      "vpc_subnet_no_public_ip_by_default",
      "vpc_flow_logs_enabled",
      "vpc_subnet_separate_private_public",
      "appstream_fleet_maximum_session_duration",
      "appstream_fleet_default_internet_access_disabled",
      "appstream_fleet_session_idle_disconnect_timeout",
      "appstream_fleet_session_disconnect_timeout",
      "route53_dangling_ip_subdomain_takeover",
      "ec2_elastic_ip_unassigned",
      "ec2_elastic_ip_shodan",
      "ec2_securitygroup_allow_wide_open_public_ipv4",
      "ec2_instance_public_ip"
    ],
    "AuditChecklist": [
      "주요 직무 수행 및 개인정보 취급 단말기 등 업무용 PC의 인터넷 접속에 대한 통제정책을 수립·이행하고 있는가?",
      "주요 정보시스템(DB서버 등)에서 불필요한 외부 인터넷 접속을 통제하고 있는가?",
      "관련 법령에 따라 인터넷망 차단 의무가 부과된 경우 대상자를 식별하여 안전한 방식으로 인터넷망 차단 조치를 적용하고 있는가?"
    ],
    "RelatedRegulations": [
      "개인정보 보호법 제29조(안전조치의무)",
      "개인정보의 안전성 확보조치 기준 제6조(접근통제)"
    ],
    "AuditEvidence": [
      "비업무사이트(P2P 등) 차단정책(비업무사이트 차단시스템 관리화면 등)",
      "인터넷 접속내역 모니터링 이력",
      "인터넷망 차단조치 대상자 목록",
      "망간 자료 전송 절차 및 처리내역(신청·승인내역 등)",
      "네트워크 구성도"
    ],
    "NonComplianceCases": [
      "사례 1 : 개인정보 보호법에 따라 인터넷망 차단 조치를 적용하였으나, 개인정보처리시스템의 접근권한 설정 가능자 등 일부 의무대상자에 대하여 인터넷망 차단 조치 적용이 누락된 경우",
      "사례 2 : 개인정보 보호법에 따른 인터넷망 차단 조치 의무대상으로서 인터넷망 차단 조치를 적용하였으나, 다른 서버를 경유한 우회접속이 가능하여 인터넷망 차단 조치가 적용되지 않은 환경에서 개인정보처리시스템에 접속하여 개인정보의 다운로드, 파기 등이 가능한 경우",
      "사례 3 : DMZ 및 내부망에 위치한 일부 서버에서 불필요하게 인터넷으로의 직접 접속이 가능한 경우",
      "사례 4 : 인터넷 PC와 내부 업무용 PC를 물리적 망분리 방식으로 인터넷망 차단 조치를 적용하고 망간 자료전송시스템을 구축·운영하고 있으나, 자료 전송에 대한 승인 절차가 부재하고 자료 전송 내역에 대한 주기적 검토가 이루어지고 있지 않은 경우",
      "사례 5 : 내부 규정에는 개인정보취급자가 P2P 및 웹하드 사이트 접속 시 책임자 승인을 거쳐 특정 기간 동안만 허용하도록 되어 있으나, 승인절차를 거치지 않고 예외 접속이 허용된 사례가 다수 존재하는 경우"
    ],
    "대응방안 - 커스토디안과 연계": [
      "네트워크 라우팅 테이블 변경 이벤트에 대한 CloudWatch 경보가 설정되어 있는지 점검",
      "인터넷 게이트웨이 또는 NAT 게이트웨이 변경에 대한 CloudWatch 알람 설정 여부 탐지",
      "VPC 설정 변경에 대한 로그 필터 및 경보가 구성되어 있는지 확인",
      "Network ACL 변경 시 감지할 수 있도록 로그 필터 및 경보 설정 여부 점검",
      "워크스페이스에서 퍼블릭/프라이빗 서브넷과 NAT 설정이 적절히 구성되었는지 확인",
      "워크스페이스 인스턴스에서 EBS 볼륨 암호화가 적용되어 있는지 점검",
      "모든 VPC에 대해 AWS Network Firewall이 적용되어 있는지 탐지",
      "서브넷에서 EC2 인스턴스 생성 시 퍼블릭 IP가 자동 할당되지 않도록 설정되어 있는지 점검",
      "VPC에 대해 Flow Logs가 활성화되어 네트워크 트래픽 모니터링이 가능한지 확인",
      "서브넷이 퍼블릭과 프라이빗으로 NAT/IGW 기준에 따라 적절히 분리되어 있는지 점검",
      "AppStream Fleet에서 세션 최대 지속 시간이 너무 길게 설정되어 있는지 탐지하여 조정",
      "기본 인터넷 접근이 비활성화되어 있는지 확인하여 내부 리소스만 접근 가능하도록 설정",
      "사용자 비활성 시 일정 시간 후 자동으로 세션을 끊는 설정 여부 점검",
      "사용자 연결이 끊긴 후 자동으로 세션을 종료하는 타이머 설정 여부 점검",
      "사용되지 않는 IP가 연결된 도메인(Subdomain)이 존재하는 경우, 하이재킹 위험이 있어 탐지 및 경고",
      "Elastic IP가 인스턴스에 연결되지 않은 상태로 방치되어 있는 경우 탐지 및 회수 유도",
      "Shodan 검색 엔진에 의해 노출된 EIP를 탐지하여 알림 또는 제거 조치",
      "0.0.0.0/0 또는 ::/0을 대상으로 모든 포트를 허용한 과도한 보안 그룹 설정을 탐지",
      "EC2 인스턴스에 퍼블릭 IP가 할당되어 있는지 탐지하여 태깅, 알림 또는 Stop 정책 설정"
    ],
    "조항 핵심 목적": [
      "CloudWatch를 사용하여 라우팅 테이블 변경 감지 알람을 설정합니다. 이는 라우팅 테이블이 공격자에 의해 변경되어 트래픽이 외부로 전송되는 사고를 방지합니다.",
      "CloudWatch 알람을 통해 인터넷 게이트웨이, NAT 게이트웨이 등의 생성 및 변경 사항을 실시간으로 감시하여 비인가 연결 발생 여부를 탐지합니다.",
      "VPC 설정 변경 사항을 CloudWatch로 모니터링함으로써 서브넷, DHCP 옵션, VPC 자체의 무단 변경을 탐지할 수 있습니다.",
      "네트워크 ACL이 공격자에 의해 수정될 경우를 대비해 변경 시 알림을 받도록 CloudWatch 알람을 구성하는 항목입니다.",
      "WorkSpaces 환경에서 퍼블릭 서브넷 1개와 프라이빗 서브넷 2개를 구성하고 NAT 게이트웨이를 활용해 보안성과 외부 연결을 동시에 확보하는 구조입니다.",
      "WorkSpaces 사용자 볼륨을 암호화하지 않으면 기기 도난 또는 해킹 시 민감한 정보가 유출될 수 있으므로 반드시 암호화를 활성화해야 합니다.",
      "모든 VPC에 대해 AWS Network Firewall을 활성화하여 상태 기반 필터링, 서명 기반 탐지를 수행함으로써 내부 트래픽의 보안을 강화합니다.",
      "퍼블릭 IP 자동 할당 기능을 비활성화함으로써 의도치 않게 외부 노출되는 인스턴스를 방지합니다.",
      "VPC 내 트래픽 로그를 활성화하여 이상 징후 분석 및 포렌식 조사에 활용할 수 있는 중요한 감사 로그를 생성합니다.",
      "퍼블릭/프라이빗 서브넷을 물리적으로 구분하여 외부 접근 가능성과 내부 자산 보호를 동시에 고려한 네트워크 구조를 설계합니다.",
      "AppStream 2.0의 세션 최대 지속 시간을 제한하여 장시간 접속에 따른 세션 하이재킹 위험을 줄입니다.",
      "기본적으로 인터넷 접근을 비활성화하여 사용자 환경이 외부로부터 격리되도록 설정합니다.",
      "사용자가 비활성 상태일 때 일정 시간 후 자동 로그아웃되어 리소스 낭비 및 보안 위협을 방지할 수 있습니다.",
      "비정상 종료된 세션을 자동으로 종료하여 동일 사용자의 불필요한 중복 세션을 방지하고 보안을 강화합니다.",
      "해제된 IP에 여전히 연결된 서브도메인을 악용한 takeover 공격을 방지하기 위해 도메인 연결 상태를 점검해야 합니다.",
      "연결되지 않은 Elastic IP는 불필요한 리소스 낭비일 뿐 아니라 공격자에 의해 재사용될 수 있는 위험 요소입니다.",
      "Shodan에 노출된 Elastic IP는 공격자에게 쉽게 탐지될 수 있으며, 해당 IP를 사용하는 인스턴스는 지속적인 스캔 대상이 됩니다.",
      "보안 그룹에서 모든 포트에 대해 0.0.0.0/0을 허용하면 전체 인터넷에 노출되어 심각한 보안 위협이 발생할 수 있습니다.",
      "퍼블릭 IP를 가진 EC2 인스턴스는 인터넷에서 직접 접근이 가능하므로, 방화벽 설정 및 접근 통제 없이 사용해서는 안 됩니다."
    ]
  }
]