[
  {
    "Id": "2.1.1",
    "Name": "정책의 유지관리",
    "Description": "정보보호 및 개인정보보호 관련 정책과 시행문서는 법령 및 규제, 상위 조직 및 관련 기관 정책과의 연계성, 조직의 대내외 환경변화 등에 따라 주기적으로 검토하여 필요한 경우 제·개정하고 그 내역을 이력관리하여야 한다.",
    "Checks": [],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.1. 정책, 조직, 자산 관리",
        "Section": "2.1.1 정책의 유지관리",
        "Purpose": [],
        "ActionPlan": [],
        "AuditChecklist": [
          "정보보호 및 개인정보보호 관련 정책 및 시행문서에 대한 정기적인 타당성 검토 절차를 수립·이행하고 있는가?",
          "조직의 대내외 환경에 중대한 변화 발생 시 정보보호 및 개인정보보호 관련 정책 및 시행문서에 미치는 영향을 검토하고 필요시 제·개정하고 있는가?",
          "정보보호 및 개인정보보호 관련 정책 및 시행문서의 제·개정 시 이해 관계자의 검토를 받고 있는가?",
          "정보보호 및 개인정보보호 관련 정책 및 시행문서의 제·개정 내역에 대하여 이력관리를 하고 있는가?"
        ],
        "RelatedRegulations": [
          "개인정보 보호법 제29조(안전조치의무)",
          "개인정보의 안전성 확보조치 기준 제4조(내부 관리계획의 수립·시행 및 점검)"
        ],
        "AuditEvidence": [
          "정보보호 및 개인정보보호 정책 및 시행문서(지침, 절차, 가이드, 매뉴얼 등)",
          "정책·지침 정기·비정기 타당성 검토 결과",
          "정책·지침 관련 부서와의 검토 회의록, 회람내용",
          "정책·지침 제·개정 이력"
        ],
        "NonComplianceCases": [
          "사례 1 : 지침서와 절차서 간 패스워드 설정 규칙에 일관성이 없는 경우",
          "사례 2 : 정보보호 활동(정보보호 교육, 암호화, 백업 등)의 대상, 주기, 수준, 방법 등이 관련 내부 규정, 지침, 절차에 서로 다르게 명시되어 일관성이 없는 경우",
          "사례 3 : 데이터베이스에 대한 접근 및 작업이력을 효과적으로 기록 및 관리하기 위하여 데이터베이스 접근통제 솔루션을 신규로 도입하여 운영하고 있으나, 보안시스템 보안 관리지침 및 데이터베이스 보안 관리지침 등 내부 보안지침에 접근통제, 작업이력, 로깅, 검토 등에 관한 사항이 반영되어 있지 않은 경우",
          "사례 4 : 개인정보보호 정책이 개정되었으나 정책 시행 기준일이 명시되어 있지 않으며, 관련 정책의 작성일, 작성자 및 승인자 등이 누락되어 있는 경우",
          "사례 5 : 개인정보 보호 관련 법령, 고시 등에 중대한 변경사항이 발생하였으나, 이러한 변경이 개인정보보호 정책 및 시행문서에 미치는 영향을 검토하지 않았거나 변경사항을 반영하여 개정하지 않은 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.1.2",
    "Name": "조직의 유지관리",
    "Description": "조직의 각 구성원에게 정보보호와 개인정보보호 관련 역할 및 책임을 할당하고, 그 활동을 평가할 수 있는 체계와 조직 및 조직의 구성원 간 상호 의사소통할 수 있는 체계를 수립하여 운영하여야 한다.",
    "Checks": [],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.1. 정책, 조직, 자산 관리",
        "Section": "2.1.2 조직의 유지관리",
        "Purpose": [],
        "ActionPlan": [],
        "AuditChecklist": [
          "정보보호 및 개인정보보호 관련 책임자와 담당자의 역할 및 책임을 명확히 정의하고 있는가?",
          "정보보호 및 개인정보보호 관련 책임자와 담당자의 활동을 평가할 수 있는 체계를 수립하고 있는가?",
          "정보보호 및 개인정보보호 관련 조직 및 조직의 구성원 간 상호 의사소통할 수 있는 체계 및 절차를 수립·이행하고 있는가?"
        ],
        "RelatedRegulations": [
          "개인정보 보호법 제29조(안전조치의무)",
          "제31조(개인정보 보호책임자의 지정)",
          "정보통신망법 제45조의3(정보보호 최고책임자의 지정 등)",
          "개인정보의 안전성 확보조치 기준 제4조(내부 관리계획의 수립·시행 및 점검)"
        ],
        "AuditEvidence": [
          "정보보호 및 개인정보보호 조직도",
          "정보보호 및 개인정보보호 조직 직무기술서",
          "정보보호 및 개인정보보호 업무 분장표",
          "정보보호 및 개인정보보호 정책·지침, 내부 관리계획",
          "정보보호 및 개인정보보호 의사소통 관리계획",
          "의사소통 수행 이력(월간보고, 주간보고, 내부공지 등)",
          "의사소통 채널(정보보호포털, 게시판 등)"
        ],
        "NonComplianceCases": [
          "사례 1 : 내부 지침 및 직무기술서에 정보보호 최고책임자, 개인정보 보호책임자 및 관련 담당자의 역할과 책임을 정의하고 있으나, 실제 운영현황과 일치하지 않는 경우",
          "사례 2 : 정보보호 최고책임자 및 관련 담당자의 활동을 주기적으로 평가할 수 있는 목표, 기준, 지표 등의 체계가 마련되어 있지 않은 경우",
          "사례 3 : 내부 지침에는 부서별 정보보호 담당자는 정보보호와 관련된 KPI를 설정하여 인사평가 시 반영하도록 되어 있으나, 부서별 정보보호 담당자의 KPI에 정보보호와 관련된 사항이 전혀 반영되어 있지 않은 경우",
          "사례 4 : 정보보호 최고책임자 및 개인정보 보호책임자가 지정되어 있으나, 관련 법령에서 요구하는 역할 및 책임이 내부 지침이나 직무기술서 등에 구체적으로 명시되어 있지 않은 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.1.3",
    "Name": "정보자산 관리",
    "Description": "정보자산의 용도와 중요도에 따른 취급 절차 및 보호대책을 수립·이행하고, 자산별 책임소재를 명확히 정의하여 관리하여야 한다.",
    "Checks": [
      "organizations_tags_policies_enabled_and_attached",
      "organizations_account_part_of_organizations",
      "macie_is_enabled",
      "config_recorder_all_regions_enabled",
      "resourceexplorer2_indexes_found",
      "account_maintain_current_contact_details",
      "account_maintain_different_contact_details_to_security_billing_and_operations",
      "account_security_questions_are_registered_in_the_aws_account",
      "account_security_contact_information_is_registered"
    ],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.1. 정책, 조직, 자산 관리",
        "Section": "2.1.3 정보자산 관리",
        "Purpose": [
          "조직 전체에 **태그 정책(Tag Policies)**이 활성화되고, OU나 계정에 실제로 적용되어 있는지 확인. 태그 기반 리소스 관리 및 비용 추적을 일관성 있게 유지하기 위함",
          "AWS 계정이 Organizations 소속인지 확인하여 중앙 집중형 관리 및 통제 구조 안에 있는지 검증. 독립 계정은 보안 정책 일관성이 낮음",
          "Amazon Macie가 활성화되어 민감 정보(예: 개인정보, 신용카드) 탐지가 가능한지 확인. 데이터 보안 및 규제 준수 목적",
          "AWS Config가 모든 리전에서 활성화되어 리소스 변경 이력을 수집하고 있는지 점검. 보안 분석 및 컴플라이언스 보고의 기반",
          "Resource Explorer v2 인덱스가 생성되어 리전/계정 내 리소스 검색 기능이 활성화되어 있는지 확인. 자산 가시성 확보 목적",
          "계정의 기본 연락처(이메일, 전화번호)가 최신인지 확인하여 보안 사고나 청구 문제 발생 시 AWS의 연락이 가능하도록 보장",
          "보안, 청구, 운영 연락처가 각기 다른 부서 또는 담당자에게 분리되어 등록되어 있는지 확인. 실무 대응력을 높이기 위함",
          "비밀번호 분실/계정 접근 문제 발생 시 계정 복구를 위한 보안 질문(Security Questions)이 설정되어 있는지 확인",
          "보안 위협 발생 시 AWS가 빠르게 연락할 수 있도록 Security Contact 정보가 등록되어 있는지 점검"
        ],
        "ActionPlan": [
          "Organizations 수준에서 태그 정책(Tag Policies)이 활성화되어 있으며, 계정/OU에 적용되었는지 확인하고 미적용 시 알림",
          "계정이 AWS Organizations의 일부인지 확인하고, 독립 계정인 경우 통합 관리 대상 외로 간주하여 알림",
          "Amazon Macie가 계정 또는 리전에 대해 활성화되어 민감 정보 탐지가 가능하도록 설정되었는지 확인",
          "AWS Config가 모든 리전에서 리소스를 기록하도록 활성화되어 있는지 확인 (글로벌 보안 모니터링 목적)",
          "Resource Explorer v2 인덱스가 구성되어 계정 내 리소스 탐색 기능이 활성화되었는지 점검",
          "AWS 계정의 기본 연락처 정보가 최신인지 확인하고 오래된 연락처 또는 미기입 시 경고",
          "보안, 청구, 운영 연락처가 동일한 경우 분리 관리 원칙에 따라 개별 지정이 되었는지 점검",
          "계정에 보안 질문(Security Questions)이 설정되어 있어 비정상 접근 시 복구 기능이 활성화되어 있는지 확인",
          "보안 위협 발생 시 AWS가 빠르게 연락할 수 있도록 Security Contact 정보가 등록되어 있는지 점검."
        ],
        "AuditChecklist": [
          "정보자산의 보안등급에 따른 취급절차(생성·도입, 저장, 이용, 파기) 및 보호대책을 정의하고 이행하고 있는가?",
          "식별된 정보자산에 대하여 책임자 및 관리자를 지정하고 있는가?"
        ],
        "RelatedRegulations": [],
        "AuditEvidence": [
          "정보자산 목록(책임자, 담당자 지정)",
          "정보자산 취급 절차(문서, 정보시스템 등)",
          "정보자산 관리 시스템 화면",
          "정보자산 보안등급 표시 내역"
        ],
        "NonComplianceCases": [
          "사례 1 : 내부 지침에 따라 문서에 보안등급을 표기하도록 되어 있으나, 이를 표시하지 않은 경우",
          "사례 2 : 정보자산별 담당자 및 책임자를 식별하지 않았거나, 자산목록 현행화가 미흡하여 퇴직, 전보 등 인사이동이 발생하여 주요 정보자산의 담당자 및 책임자가 변경되었음에도 이를 식별하지 않은 경우",
          "사례 3 : 식별된 정보자산에 대한 중요도 평가를 실시하여 보안등급을 부여하고 정보 자산목록에 기록하고 있으나, 보안등급에 따른 취급절차를 정의하지 않은 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.2.1",
    "Name": "주요 직무자 지정 및 관리",
    "Description": "개인정보 및 중요정보의 취급이나 주요 시스템 접근 등 주요 직무의 기준과 관리방안을 수립하고, 주요 직무자를 최소한으로 지정하여 그 목록을 최신으로 관리하여야 한다.",
    "Checks": [
      "organizations_delegated_administrators",
      "account_security_contact_information_is_registered",
      "iam_support_role_created"
    ],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.2. 인적 보안",
        "Section": "2.2.1 주요 직무자 지정 및 관리",
        "Purpose": [
          "GuardDuty, Config, Security Hub 등 서비스의 위임 관리자 계정(Delegated Administrator)이 지정되어 중앙 통제가 가능한지 확인",
          "보안 위협 발생 시 AWS가 빠르게 연락할 수 있도록 Security Contact 정보가 등록되어 있는지 점검",
          "AWS 지원이 계정 문제에 접근할 수 있도록 필수 IAM 역할 (예: AWSServiceRoleForSupport)이 존재하는지 확인"
        ],
        "ActionPlan": [
          "조직 계정 내 서비스별 위임 관리자(Delegated Administrator)가 설정되어 있는지 점검하고, 미지정 시 알림. 예를 들어, Security Hub, Config, GuardDuty 등 서비스마다 운영 OU의 계정을 위임자로 설정해야 관리 효율과 보안 통제를 강화할 수 있음. Custodian으로 organizations 리소스를 조회하고 list-delegated-administrators API를 통해 확인 가능.",
          "계정의 보안 연락처(Security contact)가 등록되어 있는지 탐지. AWS는 침해 징후 발생 시 이 연락처를 통해 긴급 대응 안내를 보냄. Custodian은 account 리소스에서 get-contact-information API로 security 항목 유무를 점검하고 누락 시 알림. 자동 수정을 위해 관리 콘솔 접근이 필요하므로 notify + tag 조치가 적합.",
          "AWS 계정에 AWS Support 액세스를 위한 AWSServiceRoleForSupport 역할 또는 사용자 정의 support 역할이 생성되어 있는지 점검. 없을 경우 AWS 지원 요청이 제한될 수 있으므로, IAM Role 이름, Description, Trust Policy 등을 기준으로 존재 여부를 확인. Custodian의 iam-role 필터를 활용하여 role-name: support* 또는 TrustPolicy에 support.amazonaws.com 포함 여부 확인 가능. 존재하지 않으면 Slack 알림 또는 생성 권고 조치 수행."
        ],
        "AuditChecklist": [
          "개인정보 및 중요정보의 취급, 주요 시스템 접근 등 주요 직무의 기준을 명확히 정의하고 있는가?",
          "주요 직무를 수행하는 임직원 및 외부자를 주요 직무자로 지정하고 그 목록을 최신으로 관리하고 있는가?",
          "업무상 개인정보를 취급하는 자를 개인정보취급자로 지정하고 목록을 최신으로 관리하고 있는가?",
          "업무 필요성에 따라 주요 직무자 및 개인정보취급자 지정을 최소화하는 등 관리방안을 수립·이행하고 있는가?"
        ],
        "RelatedRegulations": [
          "개인정보 보호법 제28조(개인정보취급자에 대한 감독)",
          "제29조(안전조치의무)",
          "개인정보의 안전성 확보조치 기준 제4조(내부 관리계획의 수립·시행 및 점검)"
        ],
        "AuditEvidence": [
          "주요 직무 기준",
          "주요직무자 목록",
          "개인정보취급자 목록",
          "중요 정보시스템 및 개인정보처리시스템 계정 및 권한 관리 대장",
          "주요 직무자에 대한 관리 현황(교육 결과, 보안서약서 등)"
        ],
        "NonComplianceCases": [
          "사례 1 : 주요 직무자 명단(개인정보취급자 명단, 비밀정보관리자 명단 등)을 작성하고 있으나, 대량의 개인정보 등 중요정보를 취급하는 일부 임직원(DBA, DLP 관리자 등)을 명단에 누락한 경우",
          "사례 2 : 주요 직무자 및 개인정보취급자 목록을 관리하고 있으나, 퇴사한 임직원이 포함되어 있고 최근 신규 입사한 인력이 포함되어 있지 않는 등 현행화 관리가 되어 있지 않은 경우",
          "사례 3 : 부서 단위로 개인정보취급자 권한을 일괄 부여하고 있어 실제 개인정보를 취급할 필요가 없는 인원까지 과다하게 개인정보취급자로 지정된 경우",
          "사례 4 : 내부 지침에는 주요 직무자 권한 부여 시에는 보안팀의 승인을 받고 주요 직무에 따른 보안서약서를 작성하도록 하고 있으나, 보안팀 승인 및 보안서약서 작성 없이 등록된 주요 직무자가 다수 존재하는 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.2.2",
    "Name": "직무 분리",
    "Description": "권한 오·남용 등으로 인한 잠재적인 피해 예방을 위하여 직무 분리 기준을 수립하고 적용하여야 한다. 다만 불가피하게 직무 분리가 어려운 경우 별도의 보완대책을 마련하여 이행하여야 한다",
    "Checks": [],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.2. 인적 보안",
        "Section": "2.2.2 직무 분리",
        "Purpose": [],
        "ActionPlan": [],
        "AuditChecklist": [
          "권한 오·남용 등으로 인한 잠재적인 피해 예방을 위하여 직무 분리 기준을 수립하여 적용하고 있는가?",
          "직무 분리가 어려운 경우 직무자 간 상호 검토, 상위관리자 정기 모니터링 및 변경사항 승인, 책임추적성 확보 방안 등의 보완통제를 마련하고 있는가?"
        ],
        "RelatedRegulations": [],
        "AuditEvidence": [
          "직무 분리 관련 지침(인적 보안 지침 등)",
          "직무기술서(시스템 운영·관리, 개발·운영 등)",
          "직무 미분리 시 보완통제 현황"
        ],
        "NonComplianceCases": [
          "사례 1 : 조직의 규모와 인원이 담당자별 직무 분리가 충분히 가능한 조직임에도 업무 편의성만을 사유로 내부 규정으로 정한 직무 분리 기준을 준수하고 있지 않은 경우",
          "사례 2 : 조직의 특성상 경영진의 승인을 받은 후 개발과 운영 직무를 병행하고 있으나, 직무자 간 상호 검토, 상위관리자의 주기적인 직무수행 모니터링 및 변경 사항 검토·승인, 직무자의 책임추적성 확보 등의 보완통제 절차가 마련되어 있지 않은 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.2.3",
    "Name": "보안 서약",
    "Description": "정보자산을 취급하거나 접근권한이 부여된 임직원·임시직원·외부자 등이 내부 정책 및",
    "Checks": [],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.2. 인적 보안",
        "Section": "2.2.3 보안 서약",
        "Purpose": [],
        "ActionPlan": [],
        "AuditChecklist": [
          "신규 인력 채용 시 정보보호 및 개인정보보호 책임이 명시된 정보보호 및 개인정보보호 서약서를 받고 있는가?",
          "임시직원, 외주용역직원 등 외부자에게 정보자산에 대한 접근권한을 부여할 경우 정보보호 및 개인정보보호에 대한 책임, 비밀유지 의무 등이 명시된 서약서를 받고 있는가?",
          "임직원 퇴직 시 별도의 비밀유지에 관련한 서약서를 받고 있는가?",
          "정보보호, 개인정보보호 및 비밀유지 서약서는 안전하게 보관하고 필요시 쉽게 찾아볼 수 있도록 관리하고 있는가?"
        ],
        "RelatedRegulations": [],
        "AuditEvidence": [
          "정보보호 및 개인정보보호 서약서(임직원, 외부인력)",
          "비밀유지서약서(퇴직자)"
        ],
        "NonComplianceCases": [
          "사례 1 : 신규 입사자에 대해서는 입사 절차상에 보안서약서를 받도록 규정하고 있으나, 최근에 입사한 일부 직원의 보안서약서 작성이 누락된 경우",
          "사례 2 : 임직원에 대해서는 보안서약서를 받고 있으나, 정보처리시스템에 직접 접속이 가능한 외주 인력에 대해서는 보안서약서를 받지 않은 경우",
          "사례 3 : 제출된 정보보호 및 개인정보보호 서약서를 모아 놓은 문서철이 비인가자가 접근 가능한 상태로 사무실 책상에 방치되어 있는 등 관리가 미흡한 경우",
          "사례 4 : 개인정보취급자에 대하여 보안서약서만 받고 있으나, 보안서약서 내에 비밀유지에 대한 내용만 있고 개인정보보호에 관한 책임 및 내용이 포함되어 있지 않은 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.2.4",
    "Name": "인식제고 및 교육훈련",
    "Description": "임직원 및 관련 외부자가 조직의 관리체계와 정책을 이해하고 직무별 전문성을 확보할 수 있도록 연간 인식제고 활동 및 교육훈련 계획을 수립·운영하고, 그 결과에 따른 효과성을 평가하여 다음 계획에 반영하여야 한다.",
    "Checks": [],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.2. 인적 보안",
        "Section": "2.2.4 인식제고 및 교육훈련",
        "Purpose": [],
        "ActionPlan": [],
        "AuditChecklist": [
          "정보보호 및 개인정보보호 교육의 시기, 기간, 대상, 내용, 방법 등의 내용이 포함된 연간 교육 계획을 수립하고 경영진의 승인을 받고 있는가?",
          "관리체계 범위 내 모든 임직원과 외부자를 대상으로 연간 교육 계획에 따라 연 1회 이상 정기적으로 교육을 수행하고, 관련 법규 및 규정의 중대한 변경 시 이에 대한 추가교육을 수행하고 있는가?",
          "임직원 채용 및 외부자 신규 계약 시 업무 시작 전에 정보보호 및 개인정보보호 교육을 시행하고 있는가?",
          "IT 및 정보보호, 개인정보보호 조직 내 임직원은 정보보호 및 개인정보보호와 관련하여 직무별 전문성 제고를 위한 별도의 교육을 받고 있는가?",
          "교육시행에 대한 기록을 남기고 교육 효과와 적정성을 평가하여 다음 교육 계획에 반영하고 있는가?"
        ],
        "RelatedRegulations": [
          "개인정보 보호법 제26조(업무위탁에 따른 개인정보의 처리 제한)",
          "제28조(개인정보 취급자에 대한 감독)",
          "제29조(안전조치의무)",
          "개인정보의 안전성 확보조치 기준 제4조(내부 관리계획의 수립·시행 및 점검)"
        ],
        "AuditEvidence": [
          "정보보호 및 개인정보보호 교육 계획서",
          "교육 결과보고서",
          "공통, 직무별 교육자료",
          "교육참석자 목록"
        ],
        "NonComplianceCases": [
          "사례 1 : 전년도에는 연간 정보보호 및 개인정보보호 교육 계획을 수립하여 이행하였으나, 당해 연도에 타당한 사유 없이 연간 정보보호 및 개인정보보호 교육 계획을 수립하지 않은 경우",
          "사례 2 : 연간 정보보호 및 개인정보보호 교육 계획에 교육 주기와 대상은 명시하고 있으나, 시행 일정, 내용 및 방법 등의 내용이 포함되어 있지 않은 경우",
          "사례 3 : 연간 정보보호 및 개인정보보호 교육 계획에 전 직원을 대상으로 하는 개인정보보호 인식 교육은 일정시간 계획되어 있으나, 개인정보 보호책임자 및 개인정보담당자 등 직무별로 필요한 개인정보보호 관련 교육 계획이 포함되어 있지 않은 경우",
          "사례 4 : 정보보호 및 개인정보보호 교육 계획서 및 결과 보고서를 확인한 결과, 인증범위 내의 정보자산 및 설비에 접근하는 외주용역업체 직원(전산실 출입 청소원, 경비원, 외주개발자 등)을 교육 대상에서 누락한 경우",
          "사례 5 : 당해 연도 정보보호 및 개인정보보호 교육을 실시하였으나, 교육시행 및 평가에 관한 기록(교육 자료, 출석부, 평가 설문지, 결과보고서 등) 일부를 남기지 않고 있는 경우",
          "사례 6 : 정보보호 및 개인정보보호 교육 미이수자를 파악하지 않고 있거나, 해당 미이수자에 대한 추가교육 방법(전달교육, 추가교육, 온라인교육 등)을 수립·이행하고 있지 않은 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.2.5",
    "Name": "퇴직 및 직무변경 관리",
    "Description": "퇴직 및 직무변경 시 인사·정보보호·개인정보보호·IT 등 관련 부서별 이행하여야 할 자산반납, 계정 및 접근권한 회수·조정, 결과확인 등의 절차를 수립·관리하여야 한다.",
    "Checks": [],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.2. 인적 보안",
        "Section": "2.2.5 퇴직 및 직무변경 관리",
        "Purpose": [],
        "ActionPlan": [],
        "AuditChecklist": [
          "퇴직, 직무변경, 부서이동, 휴직 등으로 인한 인사변경 내용이 인사부서, 정보보호 및 개인정보보호 부서, 정보시스템 및 개인정보처리시스템 운영부서 간 공유되고 있는가?",
          "조직 내 인력(임직원, 임시직원, 외주용역직원 등)의 퇴직 또는 직무변경 시 지체 없는 정보자산 반납, 접근권한 회수·조정, 결과 확인 등의 절차를 수립·이행하고 있는가?"
        ],
        "RelatedRegulations": [
          "개인정보 보호법 제29조(안전조치의무)",
          "개인정보의 안전성 확보조치 기준 제5조(접근 권한의 관리)"
        ],
        "AuditEvidence": [
          "퇴직 및 직무변경 절차서",
          "퇴직 시 자산(계정) 반납관리대장",
          "퇴직자 보안점검 체크리스트 및 점검 내역"
        ],
        "NonComplianceCases": [
          "사례 1 : 직무 변동에 따라 개인정보취급자에서 제외된 인력의 계정과 권한이 개인정보처리시스템에 그대로 남아 있는 경우",
          "사례 2 : 최근에 퇴직한 주요직무자 및 개인정보취급자에 대하여 자산반납, 권한 회수 등의 퇴직절차 이행 기록이 확인되지 않은 경우",
          "사례 3 : 임직원 퇴직 시 자산반납 관리는 잘 이행하고 있으나, 인사규정에서 정한 퇴직자 보안점검 및 퇴직확인서를 작성하지 않은 경우",
          "사례 4 : 개인정보취급자 퇴직 시 개인정보처리시스템의 접근 권한은 지체 없이 회수되었지만, 출입통제 시스템 및 VPN 등 일부 시스템의 접근 권한이 회수되지 않은 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.2.6",
    "Name": "보안 위반 시 조치",
    "Description": "임직원 및 관련 외부자가 법령, 규제 및 내부정책을 위반한 경우 이에 따른 조치 절차를 수립·이행하여야 한다.",
    "Checks": [],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.2. 인적 보안",
        "Section": "2.2.6 보안 위반 시 조치",
        "Purpose": [],
        "ActionPlan": [],
        "AuditChecklist": [
          "임직원 및 관련 외부자가 법령과 규제 및 내부정책에 따른 정보보호 및 개인정보보호 책임과 의무를 위반한 경우에 대한 처벌 규정을 수립하고 있는가?",
          "정보보호 및 개인정보 보호 위반 사항이 적발된 경우 내부 절차에 따른 조치를 수행하고 있는가?"
        ],
        "RelatedRegulations": [],
        "AuditEvidence": [
          "인사 규정(정보보호 및 개인정보보호 관련 규정 위반에 따른 처벌규정)",
          "정보보호 및 개인정보보호 지침 위반자 징계 내역",
          "사고 사례(전사 공지, 교육 내용)"
        ],
        "NonComplianceCases": [
          "사례 1 : 정보보호 및 개인정보보호 규정 위반자에 대한 처리 기준 및 절차가 내부 규정에 전혀 포함되어 있지 않은 경우",
          "사례 2 : 보안시스템(DLP, 데이터베이스 접근제어시스템, 내부정보유출통제시스템 등)을 통하여 정책 위반이 탐지된 관련자에게 경고 메시지를 전달하고 있으나, 이에 대한 소명 및 추가 조사, 징계 처분 등 내부 규정에 따른 후속 조치가 이행되고 있지 않은 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.3.1",
    "Name": "외부자 현황 관리",
    "Description": "업무의 일부(개인정보취급, 정보보호, 정보시스템 운영 또는 개발 등)를 외부에 위탁하거나 외부의 시설 또는 서비스(집적정보통신시설, 클라우드 서비스, 애플리케이션 서비스 등)를 이용하는 경우 그 현황을 식별하고 법적 요구사항 및 외부 조직·서비스로부터 발생되는 위험을 파악하여 적절한 보호대책을 마련하여야 한다.",
    "Checks": [],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.3. 외부자 보안",
        "Section": "2.3.1 외부자 현황 관리",
        "Purpose": [],
        "ActionPlan": [],
        "AuditChecklist": [
          "관리체계 범위 내에서 발생하고 있는 업무 위탁 및 외부 시설·서비스의 이용 현황을 식별하고 있는가?",
          "업무 위탁 및 외부 시설·서비스의 이용에 따른 법적 요구사항과 위험을 파악하고 적절한 보호대책을 마련하고 있는가?"
        ],
        "RelatedRegulations": [
          "개인정보 보호법 제26조(업무위탁에 따른 개인정보의 처리 제한)",
          "정보통신망법 제50조의3(영리목적의 광고성 정보 전송의 위탁 등)"
        ],
        "AuditEvidence": [
          "외부 위탁 및 외부 시설·서비스 현황",
          "외부 위탁 계약서",
          "위험분석 보고서 및 보호대책",
          "위탁 보안관리 지침, 체크리스트 등"
        ],
        "NonComplianceCases": [
          "사례 1 : 내부 규정에 따라 외부 위탁 및 외부 시설·서비스 현황을 목록으로 관리하고 있으나, 몇 개월 전에 변경된 위탁업체가 목록에 반영되어 있지 않은 등 현행화 관리가 미흡한 경우",
          "사례 2 : 관리체계 범위 내 일부 개인정보처리시스템을 외부 클라우드 서비스로 이전하였으나, 이에 대한 식별 및 위험평가가 수행되지 않은 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.3.2",
    "Name": "외부자 계약 시 보안",
    "Description": "외부 서비스를 이용하거나 외부자에게 업무를 위탁하는 경우 이에 따른 정보보호 및 개인정보보호 요구사항을 식별하고, 관련 내용을 계약서 또는 협정서 등에 명시하여야 한다.",
    "Checks": [],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.3. 외부자 보안",
        "Section": "2.3.2 외부자 계약 시 보안",
        "Purpose": [],
        "ActionPlan": [],
        "AuditChecklist": [
          "중요정보 및 개인정보 처리와 관련된 외부 서비스 및 위탁 업체를 선정하는 경우 정보보호 및 개인정보 보호 역량을 고려하도록 절차를 마련하고 있는가?",
          "외부 서비스 이용 및 업무 위탁에 따른 정보보호 및 개인정보보호 요구사항을 식별하고 이를 계약서 또는 협정서에 명시하고 있는가?",
          "정보시스템 및 개인정보처리시스템 개발을 위탁하는 경우 개발 시 준수하여야 할 정보보호 및 개인정보보호 요구사항을 계약서에 명시하고 있는가?"
        ],
        "RelatedRegulations": [
          "개인정보 보호법 제26조(업무위탁에 따른 개인정보의 처리 제한)"
        ],
        "AuditEvidence": [
          "위탁 계약서",
          "정보보호 및 개인정보보호 협약서(약정서, 부속합의서)",
          "위탁 관련 내부 지침",
          "위탁업체 선정 관련 RFP(제안요청서), 평가표"
        ],
        "NonComplianceCases": [
          "사례 1 : IT 운영, 개발 및 개인정보 처리업무를 위탁하는 외주용역업체에 대한 위탁계약서가 존재하지 않는 경우",
          "사례 2 : 개인정보 처리업무를 위탁하는 외부업체와의 위탁계약서상에 개인정보 보호법 등 법령에서 요구하는 일부 항목(관리·감독에 관한 사항 등)이 포함되어 있지 않은 경우",
          "사례 3 : 인프라 운영과 개인정보 처리업무 일부를 외부업체에 위탁하고 있으나, 계약서 등에는 위탁업무의 특성에 따른 보안 요구사항을 식별·반영하지 않고 비밀유지 및 손해배상에 관한 일반 사항만 규정하고 있는 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.3.3",
    "Name": "외부자 보안 이행 관리",
    "Description": "계약서, 협정서, 내부정책에 명시된 정보보호 및 개인정보보호 요구사항에 따라 외부자의 보호대책 이행 여부를 주기적인 점검 또는 감사 등 관리·감독하여야 한다.",
    "Checks": [],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.3. 외부자 보안",
        "Section": "2.3.3 외부자 보안 이행 관리",
        "Purpose": [],
        "ActionPlan": [],
        "AuditChecklist": [
          "외부자가 계약서, 협정서, 내부정책에 명시된 정보보호 및 개인정보보호 요구사항을 준수하고 있는지 주기적으로 점검 또는 감사를 수행하고 있는가?",
          "외부자에 대한 점검 또는 감사 시 발견된 문제점에 대하여 개선계획을 수립·이행하고 있는가?",
          "개인정보 처리업무를 위탁받은 수탁자가 관련 업무를 제3자에게 재위탁하는 경우 위탁자의 동의를 받도록 하고 있는가?"
        ],
        "RelatedRegulations": [
          "개인정보 보호법 제26조(업무위탁에 따른 개인정보의 처리 제한)",
          "정보통신망법 제50조의3(영리목적의 광고성 정보 전송의 위탁 등)"
        ],
        "AuditEvidence": [
          "외부자 및 수탁자 보안점검 결과",
          "외부자 및 수탁자 교육 내역(교육 결과, 참석자 명단, 교육교재 등)",
          "개인정보 위탁 계약서",
          "개인정보 처리업무 재위탁 시 위탁자 동의 증거자료"
        ],
        "NonComplianceCases": [
          "사례 1 : 회사 내에 상주하여 IT 개발 및 운영 업무를 수행하는 외주업체에 대해서는 정기적으로 보안점검을 수행하고 있지 않은 경우",
          "사례 2 : 개인정보 수탁자에 대하여 보안교육을 실시하라는 공문을 발송하고 있으나, 교육 수행 여부를 확인하고 있지 않은 경우",
          "사례 3 : 수탁자가 자체적으로 보안점검을 수행한 후 그 결과를 통지하도록 하고 있으나, 수탁자가 보안 점검을 충실히 수행하고 있는지 여부에 대하여 확인하는 절차가 존재하지 않아 보안점검 결과의 신뢰성이 매우 떨어지는 경우",
          "사례 4 : 개인정보 처리업무 수탁자 중 일부가 위탁자의 동의 없이 해당 업무를 제3자에게 재위탁한 경우",
          "사례 5 : 영리 목적의 광고성 정보전송 업무를 타인에게 위탁하면서 수탁자에 대한 관리·감독을 수행하지 않고 있는 경우"
        ]
      }
    ]
  },
  {
    "Id": "2.3.4",
    "Name": "외부자 계약 변경 및 만료 시 보안",
    "Description": "외부자 계약만료, 업무종료, 담당자 변경 시에는 제공한 정보자산 반납, 정보시스템 접근계정 삭제, 중요정보 파기, 업무 수행 중 취득정보의 비밀유지 확약서 징구 등의 보호대책을 이행하여야 한다.",
    "Checks": [],
    "Attributes": [
      {
        "Domain": "2. 보호대책 요구사항",
        "Subdomain": "2.3. 외부자 보안",
        "Section": "2.3.4 외부자 계약 변경 및 만료 시 보안",
        "Purpose": [],
        "ActionPlan": [],
        "AuditChecklist": [
          "외부자 계약만료, 업무 종료, 담당자 변경 시 공식적인 절차에 따른 정보자산 반납, 정보시스템 접근계정 삭제, 비밀유지 확약서 징구 등이 이루어질 수 있도록 보안대책을 수립·이행하고 있는가?",
          "외부자 계약 만료 시 위탁 업무와 관련하여 외부자가 중요정보 및 개인정보를 보유하고 있는지 확인하고 이를 회수·파기할 수 있도록 절차를 수립·이행하고 있는가?"
        ],
        "RelatedRegulations": [
          "개인정보 보호법 제26조(업무위탁에 따른 개인정보의 처리 제한)",
          "정보통신망법 제50조의3(영리목적의 광고성 정보 전송의 위탁 등)"
        ],
        "AuditEvidence": [
          "정보보호 및 개인정보보호 서약서",
          "비밀유지 확약서",
          "정보 및 개인정보 파기 확약서",
          "외부자 계약 종료와 관련된 내부 정책, 지침"
        ],
        "NonComplianceCases": [
          "사례 1 : 일부 정보시스템에서 계약 만료된 외부자의 계정 및 권한이 삭제되지 않고 존재하는 경우",
          "사례 2 : 외주용역사업 수행과정에서 일부 용역업체 담당자가 교체되거나 계약 만료로 퇴직하였으나, 관련 인력들에 대한 퇴사 시 보안서약서 등 내부 규정에 따른 조치가 이행되지 않은 경우",
          "사례 3 : 개인정보 처리 위탁한 업체와 계약 종료 이후 보유하고 있는 개인정보를 파기하였는지 여부를 확인·점검하지 않은 경우"
        ]
      }
    ]
  }
]